[
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/beyond-request-response-architecting-real-time-bidirectional-streaming-multi-agent-system/",
        "title": "Beyond Request-Response: Architecting Real-time Bidirectional Streaming Multi-agent System",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The blog post argues the request-response model fails for advanced multi-agent AI. It advocates for a real-time bidirectional streaming architecture, implemented by the Agent Development Kit (ADK). This streaming model enables true concurrency, natural interruptibility, and unified multimodal processing. ADK's core features are real-time I/O management, stateful sessions for agent handoffs, and streaming-native tools.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/introducing-the-jules-extension-for-gemini-cli/",
        "title": "Introducing the Jules extension for Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Introducing the Jules extension for Gemini CLI, an autonomous sidekick for developers. It accelerates coding workflows by offloading tasks like asynchronous work, bug fixes, and changes in new branches to Jules, while you stay in flow with Gemini CLI. Get started by installing the extension and using the /jules command to initiate and check task statuses.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/introducing-coral-npu-a-full-stack-platform-for-edge-ai/",
        "title": "Introducing Coral NPU: A full-stack platform for Edge AI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Coral NPU is a full-stack platform for Edge AI, addressing performance, fragmentation, and user trust deficits. It's an AI-first architecture, prioritizing ML matrix engines, and offers a unified developer experience. Designed for ultra-low-power, always-on AI in wearables and IoT, it enables contextual awareness, audio/image processing, and user interaction with hardware-enforced privacy. Synaptics is the first partner to implement Coral NPU.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/say-hello-to-a-new-level-of-interactivity-in-gemini-cli/",
        "title": "Say hello to a new level of interactivity in Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "We&#x27;re excited to announce an enhancement to Gemini CLI that makes your workflow more powerful a...",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/introducing-veo-3-1-and-new-creative-capabilities-in-the-gemini-api/",
        "title": "Introducing Veo 3.1 and new creative capabilities in the Gemini API",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google is releasing Veo 3.1 and Veo 3.1 Fast, an updated video generation model, in paid preview via the Gemini API. This version offers richer native audio, greater narrative control, and enhanced image-to-video capabilities. New features include guiding generation with reference images, extending existing Veo videos, and generating transitions between frames. Companies like Promise Studios, Latitude, and Whering are already using Veo 3.1 for various applications.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/announcing-the-genkit-extension-for-gemini-cli/",
        "title": "Announcing the Genkit Extension for Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The new Genkit Extension for Gemini CLI gives the command line deep knowledge of Genkit's architecture. It helps you build, debug, and iterate on AI apps with intelligent code generation, context-aware assistance, and tools to run flows and analyze traces directly from your terminal.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/own-your-ai-fine-tune-gemma-3-270m-for-on-device/",
        "title": "Own your AI: Learn how to fine-tune Gemma 3 270M and run it on-device",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "This guide shows you how to fine-tune the Gemma 3 270M model for custom tasks, like an emoji translator. Learn to quantize and convert the model for on-device use, deploying it in a web app with MediaPipe or Transformers.js for a fast, private, and offline-capable user experience.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/building-high-performance-data-pipelines-with-grain-and-arrayrecord/",
        "title": "Building High-Performance Data Pipelines with Grain and ArrayRecord",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "To avoid data bottlenecks when training large models, this guide introduces Grain and ArrayRecord for building high-performance data pipelines.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/level-up-your-dev-game-the-jules-api-is-here/",
        "title": "Level Up Your Dev Game: The Jules API is Here!",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google has released the Jules API, a new tool for developers to automate and integrate the software development lifecycle. The API is based on \"Source,\" \"Session,\" and \"Activity\" concepts, and Google has provided a quickstart guide to help developers begin using it.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/meet-jules-tools-a-command-line-companion-for-googles-async-coding-agent/",
        "title": "Meet Jules Tools: A Command Line Companion for Google’s Async Coding Agent",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "You can now work with Jules directly in your command line. Jules is our asynchronous coding agent th...",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/gemini-2-5-flash-image-now-ready-for-production-with-new-aspect-ratios/",
        "title": "Gemini 2.5 Flash Image now ready for production with new aspect ratios",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Our state-of-the-art image generation and editing model which has captured the imagination of the wo...",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/unlocking-multi-spectral-data-with-gemini/",
        "title": "Unlocking Multi-Spectral Data with Gemini",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Multi-spectral imagery, which captures wavelengths beyond human vision, offers a \"superhuman\" way to understand the world, and Google's Gemini models make this accessible without specialized training. By mapping invisible bands to RGB channels and providing context in the prompt, developers can leverage Gemini's power for tasks like environmental monitoring and agriculture.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/gemini-for-home-expanding-the-platform-for-a-new-era-of-smart-home-ai/",
        "title": "Gemini for Home: Expanding the Platform for a New Era of Smart Home AI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google Home is enabling new Gemini-powered features for our partners’ devices and launching a new program to help them build the next generation of AI cameras.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/introducing-tunix-a-jax-native-library-for-llm-post-training/",
        "title": "Introducing Tunix: A JAX-Native Library for LLM Post-Training",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Tunix is a new JAX-native, open-source library for LLM post-training. It offers comprehensive tools for aligning models at scale, including SFT, preference tuning (DPO), advanced RL methods (PPO, GRPO, GSPO), and knowledge distillation. Designed for TPUs and seamless JAX integration, Tunix emphasizes developer control and shows a 12% relative improvement in pass@1 accuracy on GSM8K.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/gemma-explained-embeddinggemma-architecture-and-recipe/",
        "title": "Gemma explained: EmbeddingGemma Architecture and Recipe",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "EmbeddingGemma, built from Gemma 3, transforms text into numerical embeddings for tasks like search and retrieval. It learns through Noise-Contrastive Estimation, Global Orthogonal Regularizer, and Geometric Embedding Distillation. Matryoshka Representation Learning allows flexible embedding dimensions. The development recipe includes encoder-decoder training, pre-fine-tuning, fine-tuning, model souping, and quantization-aware training.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/delight-users-by-combining-adk-agents-with-fancy-frontends-using-ag-ui/",
        "title": "Delight users by combining ADK Agents with Fancy Frontends using AG-UI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The ADK and AG-UI integration enables developers to build interactive AI applications by combining a powerful backend (ADK) with a flexible frontend protocol (AG-UI). This unlocks features like Generative UI, Shared State, Human-in-the-Loop, and Frontend Tools, allowing for seamless collaboration between AI and human users.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/apigee-operator-for-kubernetes-and-gke-inference-gateway-integration-for-auth-and-aillm-policies/",
        "title": "Apigee Operator for Kubernetes and GKE Inference Gateway integration for  Auth and AI/LLM policies",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The GKE Inference Gateway now integrates with Apigee, allowing enterprises to unify AI serving and API governance. This enables GKE users to leverage Apigee's API management, security, and monetization features for their AI workloads, including API keys, quotas, rate limiting, and Model Armor security.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/your-ai-is-now-a-local-expert-grounding-with-google-maps-is-now-ga/",
        "title": "Your AI is now a local expert: Grounding with Google Maps is now GA",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Grounding with Google Maps in Vertex AI is now generally available, helping developers build factual and reliable generative AI applications connected to real-world, up-to-date information from Google Maps. This unlocks better, more personal results and is useful across industries like travel, real estate, devices, and social media.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/continuing-to-bring-you-our-latest-models-with-an-improved-gemini-2-5-flash-and-flash-lite-release/",
        "title": "Continuing to bring you our latest models, with an improved Gemini 2.5 Flash and Flash-Lite release",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google is releasing updated Gemini 2.5 Flash and Flash-Lite preview models with improved quality, speed, and efficiency. These releases introduce a \"-latest\" alias for easy access to the newest versions, allowing developers to test and provide feedback to shape future stable releases.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/building-the-next-generation-of-physical-agents-with-gemini-robotics-er-15/",
        "title": "Building the Next Generation of Physical Agents with Gemini Robotics-ER 1.5",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Gemini Robotics-ER 1.5, now available to developers, is a state-of-the-art embodied reasoning model for robots. It excels in visual, spatial understanding, task planning, and progress estimation, allowing robots to perform complex, multi-step tasks.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/announcing-user-simulation-in-adk-evaluation/",
        "title": "Announcing User Simulation in ADK Evaluation",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The new **User Simulation** feature in the Agent Development Kit (ADK) replaces rigid, brittle manual test scripts with dynamic, LLM-powered conversation generation. Developers define a high-level `conversation_plan`, and the simulator handles the multi-turn interaction to achieve the goal. This dramatically reduces test creation time, builds more resilient tests, and creates a reliable regression suite for AI agents.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/announcing-the-agent-development-kit-for-go-build-powerful-ai-agents-with-your-favorite-languages/",
        "title": "Announcing the Agent Development Kit for Go: Build Powerful AI Agents with Your Favorite Languages",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The Agent Development Kit (ADK), an open-source, code-first toolkit for building powerful and sophisticated AI agents, now supports Go. ADK moves LLM orchestration and agent behavior directly into your code, giving you robust debugging, versioning, and deployment freedom. ADK for Go is idiomatic and performant, leveraging Go's strengths, and includes support for over 30+ databases and the Agent-to-Agent (A2A) protocol for collaborative multi-agent systems. Start building today!",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/agent-garden-samples-for-learning-discovering-and-building/",
        "title": "Agent Garden - Samples for learning, discovering and building",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Agent Garden is now available to all users to simplify AI agent creation and deployment using the Agent Development Kit (ADK). It provides curated agent samples, one-click deployment via Agent Starter Pack, and customization through Firebase Studio. It helps developers with complex business challenges and multi-agent workflows, with Renault Group cited as an early success story.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/introducing-code-wiki-accelerating-your-code-understanding/",
        "title": "Introducing Code Wiki: Accelerating your code understanding",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Code Wiki is a new platform that tackles the bottleneck of reading existing code by providing an automated, continuously updated, structured wiki for code repositories. It features hyper-linked documentation, a Gemini-powered chat agent that understands your repo, and automated diagrams. A public preview is available for open-source projects, and a Gemini CLI extension is coming soon for secure use on private repos.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/google-colab-is-coming-to-vs-code/",
        "title": "Google Colab is Coming to VS Code",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google Colab has launched an official VS Code extension, bridging the gap between the popular code editor and the AI/ML platform. The extension combines VS Code's powerful development environment with Colab's seamless access to high-powered runtimes (GPUs/TPUs), allowing users to connect local notebooks to Colab. This aims to meet developers where they are and brings the best of both worlds.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/making-the-terminal-beautiful-one-pixel-at-a-time/",
        "title": "Making the terminal beautiful one pixel at a time",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google has launched the redesigned **Android AI Sample Catalog**, a dedicated, open-source application to inspire and educate Android developers on building AI-powered apps. It showcases examples using both on-device (Gemini Nano via ML Kit GenAI API) and Cloud models (via Firebase AI Logic SDK), including image generation with Imagen, on-device summarization, and a \"Chat with Nano Banana\" chatbot. The code is easy to copy and paste to help developers quickly start their own projects.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/en/introducing-metrax-performant-efficient-and-robust-model-evaluation-metrics-in-jax/",
        "title": "Introducing Metrax: performant, efficient, and robust model evaluation metrics in JAX",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Metrax is a high-performance JAX-based metrics library developed by Google. It standardizes model evaluation by offering robust, efficient metrics for classification, NLP, and vision, eliminating manual re-implementation after migrating from TensorFlow. Key strengths include parallel computation of \"at K\" metrics (e.g., PrecisionAtK) for multiple K values and strong integration with the JAX AI Stack, leveraging JAX's performance features. It is open-source on GitHub.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/5-things-to-try-with-gemini-3-pro-in-gemini-cli/",
        "title": "5 things to try with Gemini 3 Pro in Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Gemini 3 Pro is now integrated into Gemini CLI, unlocking state-of-the-art reasoning, agentic coding, and advanced tool use for enhanced developer productivity. It's available now for Google AI Ultra and paid Gemini API key subscribers (upgrade CLI to 0.16.x). Features include generating 3D apps and code from visual sketches, running complex shell commands, creating documentation, and debugging live Cloud Run services.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/google-colab-is-coming-to-vs-code/",
        "title": "Google Colab is Coming to VS Code",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google Colab has launched an official VS Code extension, bridging the gap between the popular code editor and the AI/ML platform. The extension combines VS Code's powerful development environment with Colab's seamless access to high-powered runtimes (GPUs/TPUs), allowing users to connect local notebooks to Colab. This aims to meet developers where they are and brings the best of both worlds.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/introducing-metrax-performant-efficient-and-robust-model-evaluation-metrics-in-jax/",
        "title": "Introducing Metrax: performant, efficient, and robust model evaluation metrics in JAX",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Metrax is a high-performance JAX-based metrics library developed by Google. It standardizes model evaluation by offering robust, efficient metrics for classification, NLP, and vision, eliminating manual re-implementation after migrating from TensorFlow. Key strengths include parallel computation of \"at K\" metrics (e.g., PrecisionAtK) for multiple K values and strong integration with the JAX AI Stack, leveraging JAX's performance features. It is open-source on GitHub.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/introducing-code-wiki-accelerating-your-code-understanding/",
        "title": "Introducing Code Wiki: Accelerating your code understanding",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Code Wiki is a new platform that tackles the bottleneck of reading existing code by providing an automated, continuously updated, structured wiki for code repositories. It features hyper-linked documentation, a Gemini-powered chat agent that understands your repo, and automated diagrams. A public preview is available for open-source projects, and a Gemini CLI extension is coming soon for secure use on private repos.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/making-the-terminal-beautiful-one-pixel-at-a-time/",
        "title": "Making the terminal beautiful one pixel at a time",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google has launched the redesigned **Android AI Sample Catalog**, a dedicated, open-source application to inspire and educate Android developers on building AI-powered apps. It showcases examples using both on-device (Gemini Nano via ML Kit GenAI API) and Cloud models (via Firebase AI Logic SDK), including image generation with Imagen, on-device summarization, and a \"Chat with Nano Banana\" chatbot. The code is easy to copy and paste to help developers quickly start their own projects.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/announcing-the-agent-development-kit-for-go-build-powerful-ai-agents-with-your-favorite-languages/",
        "title": "Announcing the Agent Development Kit for Go: Build Powerful AI Agents with Your Favorite Languages",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The Agent Development Kit (ADK), an open-source, code-first toolkit for building powerful and sophisticated AI agents, now supports Go. ADK moves LLM orchestration and agent behavior directly into your code, giving you robust debugging, versioning, and deployment freedom. ADK for Go is idiomatic and performant, leveraging Go's strengths, and includes support for over 30+ databases and the Agent-to-Agent (A2A) protocol for collaborative multi-agent systems. Start building today!",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/announcing-user-simulation-in-adk-evaluation/",
        "title": "Announcing User Simulation in ADK Evaluation",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The new **User Simulation** feature in the Agent Development Kit (ADK) replaces rigid, brittle manual test scripts with dynamic, LLM-powered conversation generation. Developers define a high-level `conversation_plan`, and the simulator handles the multi-turn interaction to achieve the goal. This dramatically reduces test creation time, builds more resilient tests, and creates a reliable regression suite for AI agents.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/agent-garden-samples-for-learning-discovering-and-building/",
        "title": "Agent Garden - Samples for learning, discovering and building",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Agent Garden is now available to all users to simplify AI agent creation and deployment using the Agent Development Kit (ADK). It provides curated agent samples, one-click deployment via Agent Starter Pack, and customization through Firebase Studio. It helps developers with complex business challenges and multi-agent workflows, with Renault Group cited as an early success story.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/beyond-request-response-architecting-real-time-bidirectional-streaming-multi-agent-system/",
        "title": "Beyond Request-Response: Architecting Real-time Bidirectional Streaming Multi-agent System",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The blog post argues the request-response model fails for advanced multi-agent AI. It advocates for a real-time bidirectional streaming architecture, implemented by the Agent Development Kit (ADK). This streaming model enables true concurrency, natural interruptibility, and unified multimodal processing. ADK's core features are real-time I/O management, stateful sessions for agent handoffs, and streaming-native tools.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/introducing-the-jules-extension-for-gemini-cli/",
        "title": "Introducing the Jules extension for Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Introducing the Jules extension for Gemini CLI, an autonomous sidekick for developers. It accelerates coding workflows by offloading tasks like asynchronous work, bug fixes, and changes in new branches to Jules, while you stay in flow with Gemini CLI. Get started by installing the extension and using the /jules command to initiate and check task statuses.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/say-hello-to-a-new-level-of-interactivity-in-gemini-cli/",
        "title": "Say hello to a new level of interactivity in Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "We&#x27;re excited to announce an enhancement to Gemini CLI that makes your workflow more powerful a...",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/introducing-veo-3-1-and-new-creative-capabilities-in-the-gemini-api/",
        "title": "Introducing Veo 3.1 and new creative capabilities in the Gemini API",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google is releasing Veo 3.1 and Veo 3.1 Fast, an updated video generation model, in paid preview via the Gemini API. This version offers richer native audio, greater narrative control, and enhanced image-to-video capabilities. New features include guiding generation with reference images, extending existing Veo videos, and generating transitions between frames. Companies like Promise Studios, Latitude, and Whering are already using Veo 3.1 for various applications.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/introducing-coral-npu-a-full-stack-platform-for-edge-ai/",
        "title": "Introducing Coral NPU: A full-stack platform for Edge AI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Coral NPU is a full-stack platform for Edge AI, addressing performance, fragmentation, and user trust deficits. It's an AI-first architecture, prioritizing ML matrix engines, and offers a unified developer experience. Designed for ultra-low-power, always-on AI in wearables and IoT, it enables contextual awareness, audio/image processing, and user interaction with hardware-enforced privacy. Synaptics is the first partner to implement Coral NPU.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/announcing-the-genkit-extension-for-gemini-cli/",
        "title": "Announcing the Genkit Extension for Gemini CLI",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The new Genkit Extension for Gemini CLI gives the command line deep knowledge of Genkit's architecture. It helps you build, debug, and iterate on AI apps with intelligent code generation, context-aware assistance, and tools to run flows and analyze traces directly from your terminal.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/own-your-ai-fine-tune-gemma-3-270m-for-on-device/",
        "title": "Own your AI: Learn how to fine-tune Gemma 3 270M and run it on-device",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "This guide shows you how to fine-tune the Gemma 3 270M model for custom tasks, like an emoji translator. Learn to quantize and convert the model for on-device use, deploying it in a web app with MediaPipe or Transformers.js for a fast, private, and offline-capable user experience.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/building-high-performance-data-pipelines-with-grain-and-arrayrecord/",
        "title": "Building High-Performance Data Pipelines with Grain and ArrayRecord",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "To avoid data bottlenecks when training large models, this guide introduces Grain and ArrayRecord for building high-performance data pipelines.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/level-up-your-dev-game-the-jules-api-is-here/",
        "title": "Level Up Your Dev Game: The Jules API is Here!",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Google has released the Jules API, a new tool for developers to automate and integrate the software development lifecycle. The API is based on \"Source,\" \"Session,\" and \"Activity\" concepts, and Google has provided a quickstart guide to help developers begin using it.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/meet-jules-tools-a-command-line-companion-for-googles-async-coding-agent/",
        "title": "Meet Jules Tools: A Command Line Companion for Google’s Async Coding Agent",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "You can now work with Jules directly in your command line. Jules is our asynchronous coding agent th...",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/gemini-2-5-flash-image-now-ready-for-production-with-new-aspect-ratios/",
        "title": "Gemini 2.5 Flash Image now ready for production with new aspect ratios",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Our state-of-the-art image generation and editing model which has captured the imagination of the wo...",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/unlocking-multi-spectral-data-with-gemini/",
        "title": "Unlocking Multi-Spectral Data with Gemini",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Multi-spectral imagery, which captures wavelengths beyond human vision, offers a \"superhuman\" way to understand the world, and Google's Gemini models make this accessible without specialized training. By mapping invisible bands to RGB channels and providing context in the prompt, developers can leverage Gemini's power for tasks like environmental monitoring and agriculture.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/new-gemini-api-updates-for-gemini-3/",
        "title": "New Gemini API updates for Gemini 3",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Gemini 3 is available via API with updates for developers: new `thinking_level` for depth control, `media_resolution` for multimodal processing, and enforced `Thought Signatures` for agentic workflows, especially with function calling and image generation. It also introduces combining Google Search/URL Grounding with Structured Outputs and new usage-based pricing for Grounding. Best practices, like using default temperature, are advised for optimal results.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/unlocking-peak-performance-on-qualcomm-npu-with-litert/",
        "title": "Unlocking Peak Performance on Qualcomm NPU with LiteRT",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "LiteRT's new Qualcomm AI Engine Direct (QNN) Accelerator unlocks dedicated NPU power for on-device GenAI on Android. It offers a unified mobile deployment workflow, SOTA performance (up to 100x speedup over CPU), and full model delegation. This enables smooth, real-time AI experiences, with FastVLM-0.5B achieving over 11,000 tokens/sec prefill on Snapdragon 8 Elite Gen 5 NPU.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/build-with-google-antigravity-our-new-agentic-development-platform/",
        "title": "Build with Google Antigravity, our new agentic development platform",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Introducing Google Antigravity, a new agentic development platform for orchestrating code. It combines an AI-powered Editor View with a Manager Surface to deploy agents that autonomously plan, execute, and verify complex tasks across your editor, terminal, and browser. Agents communicate progress via Artifacts (screenshots, recordings) for easy verification. Available now in public preview.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/building-production-ai-on-google-cloud-tpus-with-jax/",
        "title": "Building production AI on Google Cloud TPUs with JAX",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "The JAX AI Stack is a modular, industrial-grade, end-to-end machine learning platform built on the core JAX library, co-designed with Cloud TPUs. It features key components like JAX, Flax, Optax, and Orbax for foundational model development, plus an extended ecosystem for the full ML lifecycle and production. This integration provides a powerful, scalable foundation for AI development, delivering significant performance advantages.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/building-ai-agents-with-google-gemini-3-and-open-source-frameworks/",
        "title": "Building AI Agents with Google Gemini 3 and Open Source Frameworks",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Gemini 3 Pro Preview is introduced as a powerful, agentic model for complex, (semi)-autonomous workflows. New agentic features include `thinking_level` for reasoning control, Stateful Tool Use via Thought Signatures, and `media_resolution` for multimodal fidelity. It has Day 0 support for open-source frameworks like LangChain, AI SDK, LlamaIndex, Pydantic AI, and n8n. Best practices include simplifying prompts and keeping temperature at 1.0.",
        "published_date": ""
    },
    {
        "website": "GOOGLE_DEVELOPERS_BLOG",
        "link": "https://developers.googleblog.com/jules-gemini-3/",
        "title": "Building with Gemini 3 in Jules",
        "thumbnail": null,
        "author": null,
        "track": null,
        "description": "Jules, an always-on, multi-step software development agent, now features Gemini 3, offering clearer reasoning and better reliability. Recent improvements include parallel CLI runs, a stable API, and safer Git handling. Upcoming features include directory attachment without GitHub and automatic PR creation. Jules aims to reduce software writing overhead so developers can focus on building.",
        "published_date": ""
    }
]