[
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=Y4OcWbMcuzE",
        "title": "Brazil Tableau User Group 28 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/Y4OcWbMcuzE?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "Imagine reduzir em mais de 90% o tempo de desenvolvimento dos seus dashboards no Tableau, sem abrir mão da qualidade e ainda garantindo consistência em toda a organização. Nesta palestra, você vai descobrir como criar e aplicar templates inteligentes de dashboards em minutos, acelerando entregas, padronizando layouts entre departamentos e levando a experiência analítica para outro nível.\n\nSeja para times de BI, áreas de negócio ou grandes corporações, você vai entender como transformar o Tableau em uma verdadeira fábrica de dashboards: rápidos, consistentes e de alto impacto.",
        "published_date": "2025-11-02 22:01:50"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=Iy8Ynqibc9M",
        "title": "Team DataFam Tableau User Group 29 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/Iy8Ynqibc9M?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "\"How I used data visualisation to understand music\" by Ludo Koelman\n\nMy journey of understanding music through the lens of data visualisation and mathematical patterns. I created my own version of a “music script language” with data visualisation best practices in mind. During this journey I realised I was on the receiving end of \"user adoption gone wrong\", reflecting on the parallel to data visualisation projects",
        "published_date": "2025-10-30 23:57:05"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=S0_NFldgjAA",
        "title": "Team DataFam Tableau User Group 21 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/S0_NFldgjAA?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "\"Ready, Set, Build! Crafting Custom Dashboard Checklists\" by Fraser Gallop\n\nFraser will share his proven approach to building tailored checklist methodologies that have driven success across dozens of client projects. From best practices to hands-on tips, his content has resonated with data analysts, business intelligence professionals, and dedicated Tableau users alike.",
        "published_date": "2025-10-29 23:57:10"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=XK3p_N5qW5w",
        "title": "Data + Women US West Coast 28 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/XK3p_N5qW5w?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "We are excited to be kicking off the start of the Data + Women: US West Coast chapter! For our friends in the Pacific Time Zone, come learn about our TUG Leaders, our path to Tableau, and discuss what YOU hope to get out of our chapter! \n\nMeet your TUG Leaders! \n\nFavorite data visualization resources\n\nMeet the community, let us know what you want to see in the future!\n\nSubmission form: https://docs.google.com/forms/d/e/1FAIpQLSdZFT1WssJ9JKFDfD8GOoS-_fQVJs6gIH7Xk9KHqcYOqyQjaQ/viewform\n\nResource list: https://docs.google.com/spreadsheets/d/1t8pe7fAUmIcb87QBSF_sl7YyAXZXLGv6hyzgi3mp5ao/edit?gid=1261743808#gid=1261743808",
        "published_date": "2025-10-29 05:11:42"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=T5uHQeVC_wo",
        "title": "Kenya Tableau User Group 25 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/T5uHQeVC_wo?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "Kickoff Event : Data Possibilities",
        "published_date": "2025-10-27 01:50:48"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=3kX44Tjyujc",
        "title": "Team DataFam Tableau User Group 7 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/3kX44Tjyujc?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "\"Documenting Your Dashboard: The Why, How, and What\" by Scott Eaton\n\nThe presentation explores the critical importance of comprehensive documentation in the development and maintenance of data dashboards. We will discuss the reasons why documentation is essential, how to document the components, and the key components that should be documented.",
        "published_date": "2025-10-26 23:53:44"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=-TU8k2pU4Dw",
        "title": "Credit Union Tableau User Group 22 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/-TU8k2pU4Dw?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "Eric Balash is the guest speaker, presenting \"9 Steps to User-Friendly Design\".\n\nJoin us and other Credit Union Tableau Users to discuss new Tableau features and better use cases for CU's. The CUTUG is a collaborative group that addresses shared opportunities, successes, and challenges.",
        "published_date": "2025-10-24 02:02:50"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=XyTOtljlh98",
        "title": "Team DataFam Tableau User Group 24 Sep 2025",
        "thumbnail": "https://www.youtube.com/v/XyTOtljlh98?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "\"From Idea to Insight: The HEB Retail Media Experience\" by Matt Huff and Blake Feiza.\n\nWe share the approach that the HEB Retail Media analytics teams use to design and deploy dashboards that deliver the stakeholder needs quickly.",
        "published_date": "2025-10-24 01:08:22"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=wUmF3v_Cdbs",
        "title": "Consultants and Freelancers Tableau User Group 22 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/wUmF3v_Cdbs?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "1) Intro\n2) “Notion - Getting More From Your Day” by Ludo Koelman, FIRN Analytics\n3) “Tableau Next … in the (almost) wild” by Fiona Crocker, Dub Dub Data\n4) Open Discussion (LIVE only, will not be included in the recording)",
        "published_date": "2025-10-23 00:37:13"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=-CHHKbIwOZo",
        "title": "Canada Tableau User Group 8 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/-CHHKbIwOZo?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "Join us for “Get a First Look at Tableau Next – Canada Edition,” an exclusive preview of Tableau’s next-generation analytics experience—now available on the Salesforce platform! Discover the latest innovations revolutionizing how organizations interact with data. In this session, Candi and Kirk will walk you through a hands-on demo—from connecting to data and building a semantic layer to creating trusted metrics and leveraging AI-powered insights.\n\nExplore how Tableau Next simplifies the analytics workflow, empowers teams across your organization, and supports smarter, faster decision-making. Whether you're a data analyst, business leader, or IT decision-maker, this is your chance to see how Tableau is making data more accessible than ever.",
        "published_date": "2025-10-20 03:03:58"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=XgdVUSXO0wI",
        "title": "Tableau Public Tableau User Group 16 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/XgdVUSXO0wI?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "October Tableau Public TUG: Spooky Fall Spectacular\n• Ilija Stojić – shares his harrowing tale of becoming a 1st time Tableau Ambassador.\n• Anne-Sophie Pereira – will present her classic Viz of the Day, Six reasons to watch Buffy the Vampire Slayer\n• Lucia Stefanuto– will present her Halloween - Best Candy Ever Viz of the Day\n\nWatch the October Tableau Public TUG to learn how to do really cool stuff in Tableau.",
        "published_date": "2025-10-20 01:23:34"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=DOjJRf1XW0c",
        "title": "Advancement Tableau User Group 14 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/DOjJRf1XW0c?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "\"From Activities to Outcomes: Measuring the Full Impact of Prospect Development Teams\"\nProspect development plays a critical role in advancing fundraising success, yet much of its impact extends beyond what standard CRM reports capture. In this session, Prisca Zaccaria and Jose Osorno from the University of South Carolina will share how they use the Prospect Development Scorecard and Log to evaluate both the quantitative and qualitative contributions of prospect research and management. Together, these tools link CRM data and harder-to-measure activities to pipeline movement, gift results, and overall fundraising progress.",
        "published_date": "2025-10-16 11:42:16"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=GWPVnK5-NJw",
        "title": "Video Games Tableau User Group 13 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/GWPVnK5-NJw?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "⭐ The power of data in publishing a video game by Emmanuel Rosier\nWe all know the importance of data in bringing a product into market, and video games is no different. With over 10 years of experience in this industry, Emmanuel will share about how the current market landscape is like, and what it looks like to have data drive launch insights – from release timings, early access best practices to how attrition unfolds. \n\n\n⭐From Pixels to Patterns: Early Analytics Shaping Games by Celia Fryer\nStep back into the early days of gaming and visual analytics, where dashboards weren’t just about numbers—they changed the course of game design itself. We’ll revisit some early gaming history and look at a couple Tableau dashboards that influenced key decisions were part of decisions for player experience, offering a glimpse at how data-driven insights became part of the creative process. \n\n \n⭐ Other than that, we have a few more items to chat about:\nWhat's everyone playing and their favorite games? (Of course we had to sneak in some data collection right? 😉)\n- Cadence of the business\n- Timeline of key industry events\n- Quick overview of the metrics we measure\n- How you can get started with #GamesNightViz",
        "published_date": "2025-10-16 10:53:27"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=40DDpZXAws8",
        "title": "Austin Tableau User Group 9 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/40DDpZXAws8?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "Schedule of Events\n3:30 PM: Welcome & Introductions\n\nJust a quick welcome and introduction to get the TUG started before we jump into the good stuff.\n\n3:45 PM: Community Spotlight, Cameron Brown\n\nLearn about one of our community members, Cameron Brown, Account Executive, Tableau Software.\n\n4:00 PM: Feature Presentation: All things AI in Tableau, Ojoswi Basu\n\nDiscover how AI and natural language are transforming the way we interact with data in Tableau. This session will showcase practical demos and insights into these powerful capabilities.\n\n4:30 PM: TableauNext Beta Wrap-up, Celia Fryar\n\nGet an inside look at TableauNext beta with a focus on semantic modeling, data governance, and opportunities to enable agentic analytics. This short wrap‑up will highlight key insights shaping the next era of Tableau.",
        "published_date": "2025-10-16 09:37:03"
    },
    {
        "website": "YOUTUBE_TABLEAU_DATAFAM",
        "link": "https://www.youtube.com/watch?v=Fu5pyq6yW_s",
        "title": "Chennai Tableau User Group 4 Oct 2025",
        "thumbnail": "https://www.youtube.com/v/Fu5pyq6yW_s?version=3",
        "author": "The DataFam Tableau User Groups",
        "track": null,
        "description": "Unlocking KPI Cards with Map Layers by Prasann Prem",
        "published_date": "2025-10-14 10:52:22"
    }
]