[
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/shorts/zUFqvC_CJBM",
        "title": "How is AI opening up investing?",
        "thumbnail": "https://www.youtube.com/v/zUFqvC_CJBM?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "We caught up with Tamara Kostova, CEO of @Velexa. She explains how their platform is helping more people make smarter decisions on the markets. It’s another sector that’s becoming available to everyone.",
        "published_date": "2025-11-28 08:32:16"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=gqj6f3oTpME",
        "title": "How TGS modernized for faster energy insights with Google Cloud Consulting",
        "thumbnail": "https://www.youtube.com/v/gqj6f3oTpME?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Ready to disrupt your industry? Google Cloud Consulting can show you how: https://goo.gle/482CNXl\n\nLearn how TGS, a leader in the energy data industry, partnered with Google Cloud Consulting to dramatically accelerate its data processing from weeks to days. Louis Bailleul, Director of Architecture and Platform Engineering at TGS, explains how the company tackled the challenge of modernizing its on-premise environment by migrating its High-Performance Computing (HPC) system to Google Cloud and running one of the biggest GKE clusters supported. Discover how the Google Cloud Consulting team provided the expertise needed to build this new environment, solve complex challenges, and enable TGS to deliver critical energy data to its customers faster than ever before.",
        "published_date": "2025-11-25 20:33:59"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=1sDQ98_ct00",
        "title": "Mainframe Modernization without Compromises: Meet Imogen on Google Cloud",
        "thumbnail": "https://www.youtube.com/v/1sDQ98_ct00?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Modernizing and rewriting mainframe applications doesn't have to be a high-risk, high-disruption project. With Mechanical Orchard's Imogen platform, you can safely and reliably move your critical mainframe systems to Google Cloud.\n\nIn the video, discover Mechanical Orchard's Imogen platform on Google Cloud, the safe and reliable way to modernize your most complex, critical mainframe systems. Imogen uses a unique behavior-first approach to replicate your mainframe system's behavior incrementally into verified, cloud-native code. This makes your new codebase easier to maintain and advance, without the high risk of a traditional rewrite.\n\nWith Imogen, you deploy incrementally, minimize risk, and achieve continuous mainframe modernization.\n\nLearn more and start your modernization journey today.\nhttp://mechanical-orchard.com\n\n#Mainframe #GoogleCloud #Modernization #DevOps #CloudMigration",
        "published_date": "2025-11-25 14:00:04"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=q_NZB2XuELg",
        "title": "New Way Now: How Panorays automates third-party cyber risk with Google Cloud and Gemini",
        "thumbnail": "https://www.youtube.com/v/q_NZB2XuELg?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Panorays helps organizations manage third-party security risks, but manual assessments can often be time-consuming and leave room for error. To combat this, Panorays turned to Google Cloud to help their defense evolve alongside the risk landscape.\n\nWatch how Panorays uses Google Cloud’s Vertex AI and Gemini models to automate manual tasks, including the classification of cyber news and alerts. This integration has allowed them to reduce their support team's workload by 75%, keeping companies ahead of threats and ready to respond.",
        "published_date": "2025-11-24 20:52:32"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=LXq9n4cgOzA",
        "title": "Simplify and Accelerate your Google Cloud Security Operations with Wiz and Gemini",
        "thumbnail": "https://www.youtube.com/v/LXq9n4cgOzA?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Learn more about Google SecOps and Wiz technical partner integrations on the Cloud Partner Advantage Portal, here: https://goo.gle/3KcTjuG\n\nThis video demonstrates how to integrate Google SecOps, Wiz and Gemini to optimize your Security Operations deployment",
        "published_date": "2025-11-24 15:23:00"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=zdZV4_GqAqs",
        "title": "Cloud Assist Investigations: Troubleshoot with AI",
        "thumbnail": "https://www.youtube.com/v/zdZV4_GqAqs?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Cut through the complexity of cloud troubleshooting with Cloud Assist Investigations. \n\nEnroll in the full course today! → https://goo.gle/4rbJvle\n\nThis course will help you understand Cloud Assist Investigations, how to incorporate it with existing products and services, and interpret real-world results.",
        "published_date": "2025-11-21 18:33:04"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=fYXFd7qOhZI",
        "title": "New Way Now: Lowe’s lays a data foundation for more helpful home management",
        "thumbnail": "https://www.youtube.com/v/fYXFd7qOhZI?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "*Featured in this video:* Chandhu Nair, Senior Vice President of Technology for Data, AI, and Innovation at Lowe's\n\n*Executive summary:* Lowe’s, one of the world’s largest home improvement retailers, is building the future of home improvement, pioneering new AI capabilities that give associates superpowers to better serve its customers. After modernizing its online business with Google Cloud, Lowe’s expanded its partnership to renovate its data infrastructure for the AI era, migrating its vast data resources to Google’s data cloud. Using BigQuery and Vertex AI, Lowe’s can now unify all its data — structured and unstructured — and connect it to the latest AI technologies, reducing the time to gain insights to hours instead of days or weeks. Now, Lowe’s has the foundations it needs to power AI apps and tools that enhance in-store search, product recommendations, and inventory optimization, helping hundreds of thousands of store associates across its 1,700 stores confidently assist customers with their home improvement journeys.\n\n*Challenge:* Lowe’s had extensive structured data, but also possessed a wealth of valuable unstructured information, such as training materials, manuals, standard operating procedures, and decades of collected practical know-how. Lowe’s wanted to bring together all of its data and utilize it to help associates guide customers more effectively. \n\n*Solution:* After modernizing its online business with Google Cloud, Lowe’s expanded its partnership to renovate its data foundations for the AI era. Lowe’s migrated its data resources to Google’s data cloud, using BigQuery to build a unified data analytics foundation and integrating it with Vertex AI to connect all of its data to the latest AI technologies. The new architecture has become the backbone of its AI initiatives, allowing Lowe’s to not only collect data at scale but use it to power new AI apps and tools for search, product recommendations, and inventory optimization. In addition, Vertex AI has helped to speed up collecting, processing, and analyzing data, drastically reducing the time it takes to gain insights from weeks down to hours. \n\n*Results:* With Google’s data cloud, Lowe’s now has the data foundations it needs to develop new AI capabilities that facilitate remarkable new ways to unlock and distribute expertise, enabling more than 300,000 associates across its 1,700 stores to assist customers during the home improvement journeys with greater knowledge and confidence.\n\n*Key takeaways and highlights from our interview with Chandhu Nair, Senior Vice President of Technology for Data, AI, and Innovation at Lowe's:* \n\n→ “We've been undergoing this tremendous transformation, which is really modernizing our stack. Part of that was putting our online business on the cloud, putting our data on the cloud. Now, you have a connected ecosystem of this data, and then it's all available practically near real time. We have an AI stack that sits on top of it and simplifies it and creates action out of it, and we made significant advances in terms of shifting from days and weeks of trying to harvest this data and get insights to within a few hours.”\n\n→ “AI is like a force multiplier. We can now connect all of this data to provide intelligent recommendations for our customers, whether that is when to maintain your yard or how to maintain appliances. You don’t have to go through hundreds of thousands of manuals to actually get to that. There is nothing better than leveraging AI to augment the expertise that our associates have and really superpower them with AI-powered tools.” \n\n→ “We’ve been working with Google Cloud as a partner over the last five plus years. Google is already a leader in the data space. Vertex AI and that framework is really helping us not just harvest the data, but power it through different AI products and tools at scale, converting that into actionable outcomes that drive value for the business.”\n\n*Google Cloud products used:* Vertex AI, BigQuery\n\n*Learn more:* https://corporate.lowes.com/",
        "published_date": "2025-11-20 21:00:54"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=yF_V0TYwSyE",
        "title": "What is smart storage? Meet Google Cloud's storage vision",
        "thumbnail": "https://www.youtube.com/v/yF_V0TYwSyE?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Learn more about smart storage here: https://goo.gle/4oQD9Gs\n\nJoin us for an insightful fireside chat as we explore Google Cloud's new vision for smart storage, a paradigm shift that transforms storage from a passive container into an active, intelligent engine. Hosted by Asad Khan (Senior Director, Google Cloud) and Dave McCarthy (Research VP, IDC), this discussion covers the future of intelligent data infrastructure and what it means to build on an AI-ready foundation.Learn more about smart storage here: https://goo.gle/4oQD9Gs",
        "published_date": "2025-11-19 17:34:09"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=qiVVCKEwF7w",
        "title": "How Palo Alto Networks Is Securing AI at Scale with Google Cloud Spanner",
        "thumbnail": "https://www.youtube.com/v/qiVVCKEwF7w?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Learn more about Spanner and start a free trial today, with the link being: https://goo.gle/4i9fuhX\n\nAs every SaaS application becomes AI-aware, security risks multiply. Palo Alto Networks recognized the need to move their core ecosystem to a database that could provide unparalleled security, global availability, and immense scale to stay ahead of these new threats.  This video explains how Palo Alto relies on Google Cloud's portfolio (Spanner, BigQuery, GKE, DataProc, Cloud Composer) stitched together in a cohesive, multi-tenant architecture. Google Cloud Spanner is at the heart of their strategy, serving as the scalable, fault-tolerant, multi-model persistent store for all their critical customer workflows.  The video highlights their innovative use of Spanner Graph which allowed them to unlock a crucial graph use case (access control) without the need for a separate graph database or specialized expertise. Spanner's ability to offer 99.999% availability and globally distributed architecture gives Palo Alto Networks the confidence to build and deploy comprehensive security products across all their customers.  See how Palo Alto Networks uses Spanner to take the heavy lifting away and focus on unlocking customer value.",
        "published_date": "2025-11-19 17:05:18"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=Ty6qYOoI98E",
        "title": "New Way Now: Deloitte stops state-sponsored cyberattack; identifies threats 66% faster with Google",
        "thumbnail": "https://www.youtube.com/v/Ty6qYOoI98E?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "*Featured in this video:* Caroline Honeycombe, Director of Cyber Incident Response at Deloitte, and Paul Beverley-Paddock, Director, Security Operations Lead at Deloitte\n\n*Executive summary:* Deloitte, one of the biggest and oldest global consulting firms, tackles a huge range of challenges for clients — from boardroom strategy to technical implementation. One recent win was hugely impactful: the firm helped stop a state-sponsored cyberattack before it could affect public and digital services across Europe. Stopping that attack and reclaiming highly sensitive compromised data depended on a solution built using both the Google Security Operations and Google Threat Intelligence platforms along with Gemini. The Deloitte team ingested billions of log data points into Google SecOps, then used Gemini to ask questions of the data to decide how to tackle particular threats. That new visibility and searchability turned data points into prioritized actions the team could take immediately to counter and remove the threat. Deloitte’s AI-powered Illuminator also visualizes data so teams can identify and neutralize potential threats. The new solution has brought huge gains for level 1 and 2 analysts, who can identify threats 66% more efficiently by analyzing alerts and identifying whether they’re a true positive or false positive and what, if any, action should be taken.\n\n*Challenge:* The complexity and scale of data, and sophistication of bad actors, have grown concurrently to offer new challenges for security teams. The foiled cyberattack at Deloitte’s client came from sophisticated threat actors, though they used typical IT organization tools that made it easier to hide the threat. For Deloitte, the key ingredients in building a system to counter these new, fast-moving threats were speed and the ability to parse tremendous amounts of data immediately. \n\n*Solution:* The integration of SecOps and Threat Intelligence meant that Deloitte’s team could quickly identify who the threat actor was, and take action. Along with these Google Cloud Security tools, the natural language search capabilities of Gemini in SecOps allow the Deloitte team to ask questions in real time, such as whether and what type of detection rule should be written. Those answers brought both speedy insights and prioritized actions so the team could remove the threat and re-secure the environment. Along with those short-term reactions, the Deloitte team can now build improved client capabilities so they’re more protected in the long term and better able to react to threats going forward.\n\n*Results:* Gemini AI’s capabilities applied to massive amounts of data now let Deloitte’s cybersecurity clients’ teams quickly identify and remove threats before they can attack and cause any number of disruptions. This combination of AI and security technology has helped Deloitte reimagine their entire approach to the challenges of modern threat detection. The team is able to act faster than ever before with previously unimaginable depth and hugely increased efficiency in identifying threats.\n\n*Key takeaways and highlights from our interview with Caroline Honeycombe, Director of Cyber Incident Response at Deloitte, and Paul Beverley-Paddock, Director, Security Operations Lead at Deloitte:*\n\n→ “It essentially gave us speed, scale, depth. We can act faster than we could before with a depth we couldn’t have dreamed of. We’re able to help clients ‘shift left’ and put threat intelligence at the heart of everything we do.” —Paul Beverley-Paddock\n\n→ “Bringing in Google allowed us get insights into what we were facing and very quickly reduce billions of data points into very short, prioritized actions that we were able to take to remove the threat actor from the environment, re-secure the environment, and build the client’s capability so they’re more protected and in a better position to react going forward.” —Paul Beverley-Paddock\n\n→ “Being able to use Google SecOps to actually search what we’re after has been super powerful. And we’ve now got a really nice picture of forensics data, log data, and threat intelligence in one place.” —Caroline Honeycombe\n\n→ “Taking AI as an example, Google is one step ahead of where technology is going and what is happening in the market. Google Cloud is helping Deloitte find a new way to hunt threats faster.” —Caroline Honeycombe\n\n*Google Cloud products used:* Google Security Operations, Google Threat Intelligence, Gemini\n\n*Learn more:*\n\n→ Entering the era of generative AI-enabled security https://cloud.google.com/security/resources/entering-era-gen-ai-enbl-security?hl=en \n\n→ Make Google part of your security team https://cloud.google.com/security",
        "published_date": "2025-11-19 16:00:49"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=xg7SFprpr4I",
        "title": "New Way Now: ID.me fights fraud for over 145 million users — powered by AlloyDB",
        "thumbnail": "https://www.youtube.com/v/xg7SFprpr4I?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "*Featured in this video:* Kevin Liu, Cloud Platform Architect at ID.me\n\n*Executive summary:* Identity management technology provider ID.me offers a single login product for its users to safely transact across the internet. The platform quickly grew from 50 million to 145 million users — a tremendous increase that also brought challenges in supporting multitudes of data and related generative AI projects. After searching for the right cloud partner to handle those many terabytes of data, ID.me chose Google Cloud and shifted its biggest workloads to AlloyDB. This new infrastructure backbone has helped democratize data and empower users across the company to build better models, optimize queries and applications, and serve customers with true high availability. ID.me has built secure sign-on capabilities and better models, and can now prevent or remediate fraud in real time. \n\n*Challenge:* To offer its digital wallet safely and quickly to its growing base of millions of users, ID.me had to strengthen its data foundation. The company runs huge workloads that require high availability for terabytes of data, and previous databases had taken up data teams’ time with self-management. ID.me has also built generative AI identities, which brought potential fraud risk, so they needed to add functionality to ensure that users are real people.\n\n*Solution:* ID.me moved dozens of terabytes of data into Google Cloud’s AlloyDB database, which now runs workloads of more than 10 TB apiece. The secret sauce that makes AlloyDB work for ID.me: its ability to actually separate storage and compute. AlloyDB also allows for the creation of multiple read pools, one for each workload. That means that ID.me can isolate those sets of data into data clean rooms for validation, then remediate or prevent issues in real time. That’s essential to ensure that gen AI models only access trusted data.\n \n*Results:* ID.me’s new powerful back-end has democratized data and led to massive scalability and availability, and they’ve seen a price decrease in their infrastructure. Data engineers and DBAs can now focus on building and optimizing apps, and teams overall have saved tremendous amounts of time compared to previous self-managed database instances. ID.me has built better fraud prevention models and saved at least a billion dollars in fraud by IRS standards. \n\n*Key takeaways and highlights from our interview with Kevin Liu, Cloud Platform Architect at ID.me:*\n\n→ “Everyone loves AI right now, but if you don’t have a truly solid data layer, all of your AI models are going to be problematic.”\n\n→ “What we love best about Google Cloud is how much better a developer experience we have now. We go from zero to full product application in days vs. weeks now.”\n\n→ “Using AlloyDB has truly opened up our data engineers and DBAs to help them optimize applications, optimize queries, or build in-place ML applications.”\n\n*Google Cloud products used:* AlloyDB, AlloyDB AI\n\n*Learn more:*\n\n→ Reflecting on two years of AlloyDB https://cloud.google.com/blog/products/databases/reflecting-on-two-years-of-alloydb \n\n→ From query to cart: Inside Target’s search bar overhaul with AlloyDB AI https://cloud.google.com/blog/topics/retail/from-query-to-cart-inside-targets-search-bar-overhaul-with-alloydb-ai \n\n→ New agents and AI foundations for data teams https://cloud.google.com/blog/products/data-analytics/new-agents-and-ai-foundations-for-data-teams",
        "published_date": "2025-11-18 21:01:12"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=x36QJ-QKRGg",
        "title": "Pager Health Simplifies the Healthcare Journey with Google Cloud SQL",
        "thumbnail": "https://www.youtube.com/v/x36QJ-QKRGg?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Get started with a Cloud SQL free trial instance today: https://goo.gle/4plPQsI\n\nPager Health is transforming the complex U.S. healthcare experience into a simple, accessible, and personalized journey. See how they partnered with Google Cloud to solve fragmentation and operational overhead by migrating to fully managed services like Cloud SQL, GKE, and leveraging BigQuery and Vertex AI for advanced analytics and personalized care. For Pager, it’s not just digital transformation—it’s about transforming lives.",
        "published_date": "2025-11-18 20:12:43"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=aHiTEY4Xx54",
        "title": "Trase Systems: AI Agents for Healthcare Administrative Automation",
        "thumbnail": "https://www.youtube.com/v/aHiTEY4Xx54?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Deploy world-leading AI agents on Google Cloud to unlock measurable ROI in healthcare. This video showcases how Trase Systems delivers customized, end-to-end solutions, leveraging Vertex AI and Gemini for rapid, HIPAA-compliant automation of complex administrative workflows. Learn how the Shared Savings Model minimizes financial risk and accelerates time-to-value for health systems.",
        "published_date": "2025-11-18 14:34:38"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=kDrJfaoqCl4",
        "title": "Dun & Bradstreet Builds a Foundation for Innovation with Google Cloud: Powering Global Risk Data at",
        "thumbnail": "https://www.youtube.com/v/kDrJfaoqCl4?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Try a Cloud SQL free Trial Instance today: https://goo.gle/3Xz9hlL\n\nAs a leading provider of business decisioning data, Dun & Bradstreet is trusted by customers to help them make complex decisions regarding risk mitigation, compliance, and growth. Before their partnership with Google Cloud, their infrastructure was fragmented across multiple providers and a physical data center.  In this video, Raghul Nandagopal, Vice President of Engineering at Dun & Bradstreet, explains how they chose Google Cloud for its powerful, simple, and secure architecture. By selecting Google Kubernetes Engine (GKE) and Cloud SQL—leveraging its multi-engine support for PostgreSQL, MySQL, and SQL Server—D&amp;B established a unified cloud environment.  This centralized approach not only offers unparalleled security and simplified scaling but also allows D&amp;B's DBAs and developers to focus on innovating rather than managing infrastructure. They are excited to leverage future technologies like Spanner and Google's Database Migration Assistant to continue driving their business forward.",
        "published_date": "2025-11-17 20:05:31"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=76okQTyiNyw",
        "title": "2x champion, Zaza Pachulia puts AI basketball coach to the test",
        "thumbnail": "https://www.youtube.com/v/76okQTyiNyw?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Learn more→ https://goo.gle/3WXTAV9 \nRead the case study→ https://goo.gle/48isePM\n\nWe built an AI basketball coach with Gemini on Vertex AI. Zaza Pachulia put it to the test 🏀  Hey Bay Area, learn how Vertex AI on Google Cloud and Gemini can help turn observation into insight for athletes like Zaza, the Golden State Warriors' basketball operations department, and wherever there’s a need to derive intelligence from physical motion.",
        "published_date": "2025-11-17 18:04:41"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=fcnYWgHibbo",
        "title": "What happens when AI, Cloud, and Mobile converge?",
        "thumbnail": "https://www.youtube.com/v/fcnYWgHibbo?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "In a special discussion, Google Cloud's own Sachin Gupta, VP/GM for Infrastructure and Solutions Group, sits down with Erik Ekudden, CTO of Ericsson. Together, they explore how this powerful combination is reshaping industries and creating new opportunities for communication service providers.\n\n#GoogleCloud #Ericsson #AI #CloudComputing #5G #Innovation #DigitalTransformation\n\n00:00 Power of AI, Clould and Mobile\n02:12 Efficiency gains in 5G\n05:00 Enablers and growth opportunities\n09:04 5G as a digital platform\n11:18 Impact of ecosystem collaboration and wrap-up",
        "published_date": "2025-11-14 21:03:32"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/shorts/cccMsD6L99Q",
        "title": "How do you ask your board for a cybersecurity budget?",
        "thumbnail": "https://www.youtube.com/v/cccMsD6L99Q?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Monica Verma (@MonicaTalksCyber)  leading CISO, always has a 3-tier approach, because a board wants options, not ultimatums. \n\nWatch how her approach works. Do you agree?",
        "published_date": "2025-11-14 12:40:14"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=9_akO0Q9Z3k",
        "title": "Looker Conversational Analytics – The intelligent evolution of BI",
        "thumbnail": "https://www.youtube.com/v/9_akO0Q9Z3k?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Try Looker Conversational Analytics: https://goo.gle/4hRLGWI\n\nLooker Conversational Analytics, powered by Gemini AI, signals the intelligent evolution of Business Intelligence by democratizing data access. Users can now bypass complex interfaces and ask sophisticated business questions in plain, natural language, receiving immediate, governed answers and visualizations. Crucially, this feature is uniquely grounded in the LookML semantic layer—your single source of truth—ensuring every insight is accurate, consistent, and compliant with Looker's strict Zero Model Training policy; this transforms data exploration into an instant, trusted, and highly accessible experience for everyone in your organization.",
        "published_date": "2025-11-12 15:41:56"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=bN7p66GYu8Q",
        "title": "Chat with your data in BigQuery",
        "thumbnail": "https://www.youtube.com/v/bN7p66GYu8Q?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Try BigQuery: https://goo.gle/3JHkIo6\n\nBigQuery's AI-powered Conversational Analytics agent makes data accessible to everyone, from business users to data scientists. You can ask questions in plain language and receive answers directly from your BigQuery data.  Business users can now quickly get answers and interact with data agents. Developers can rapidly build data applications, create and edit agents, and deploy them flexibly. Data analysts can query, analyze, and build data agents, improving exploration and collaboration.  Integrated within BigQuery Studio, the agent leverages Gemini to generate, execute, and deliver answers from your BigQuery tables, thereby reducing coding effort and increasing actionable insights.",
        "published_date": "2025-11-10 05:00:44"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=JlG37pVayf8",
        "title": "How Nuro transformed end-to-end AI and data discovery with Google Cloud Consulting",
        "thumbnail": "https://www.youtube.com/v/JlG37pVayf8?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Ready to disrupt your industry? Google Cloud Consulting can show you how…https://cloud.google.com/consulting\n\nLearn how Nuro, a leader in the self-driving vehicle space, partnered with Google Cloud Consulting to provide scalable infrastructure capable of simulating millions of scenes daily. Fei Meng, Head of Data Platform at Nuro,explains how the company needed a robust infrastructure to support training different models. They specifically leveraged Google Cloud to execute a critical database migration for a unified data backend and utilize powerful Vector Search. Discover how the Google Cloud Consulting team provided the engineering support and expertise needed to ensure a successful database migration and deliver cost-effective, high-quality search capabilities that simplified infrastructure setup.",
        "published_date": "2025-11-10 05:00:33"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=zJjqNqVIf0c",
        "title": "Make code reviews your most effective line of defense with Qodo and Google Cloud",
        "thumbnail": "https://www.youtube.com/v/zJjqNqVIf0c?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Head to http://qodo.ai to learn how to revolutionize your software development with Qodo, the intelligent code integrity platform built on Google Cloud. Empower your developers with a comprehensive suite of AI agents for code generation, automated testing, and insightful reviews, leading to significantly enhanced code quality, streamlined workflows, and accelerated delivery cycles. Leverage the power of context-aware AI, seamlessly integrated into your existing IDEs and Git platforms, all underpinned by the reliability and performance of Google Cloud.",
        "published_date": "2025-11-07 14:01:52"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=-wEDi5fjrsw",
        "title": "New Way Now: Costco processes bulk-size data with AI for better member experience",
        "thumbnail": "https://www.youtube.com/v/-wEDi5fjrsw?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "*Featured in this video:* Harish Rao, Global VP of Data and Analytics for Costco Wholesale\n\n*Executive summary:* Beloved bulk retailer Costco operates more than 900 warehouses globally, with members getting discounts on everything from food to flights. To serve its members with great experiences, value, and products across any channel — in-person, via email, mobile app, or marketplace — the data team needed to build a member 360 view. Costco chose Google Cloud’s data and AI tools and partnered with Accenture to build its Unified Data Platform. The new platform brings trusted data to its 175,000 users, helping them to make better, faster decisions. And suppliers can better understand member behavior through aggregated data, all with the same goal: bringing value to members and delighting them with the merchandise in any Costco warehouse. Using Vertex and Gemini AI capabilities was foundational to the new platform’s ability to empower and expand teams’ work.\n\n*Challenge:* Costco maintains massive amounts of data and needed a modern data and AI platform to add even more innovation, efficiency, and flexibility to help its teams meet their shared goal of bringing value to members. With so many partners, hyperscalers, and technologies available, and with so much data, Costco enlisted Accenture’s help in researching and creating the right omnichannel solution.\n\n*Solution:* Costco knew they would need a large data and AI footprint, so Google Cloud’s product depth, hyperscale, cost-effectiveness, and native capabilities were the right fit. Costco’s team built a robust platform, allowing them to democratize data to teams across the company and open up new opportunities, such as helping merchandisers understand sales and inventory positions, track promotion performance, and improve return and other processes.\n\n*Results:* The data team has already seen short-term wins with its unified platform, such as cutting the time required to create new audiences from several weeks to 30 minutes. Suppliers can access aggregated data about member shopping behavior to tailor their offerings. In the longer term, Costco is using data and AI technology to bring more value to members and to the bottom line. As Costco’s leadership prepares to profitably double the company size in the next decade, AI capabilities will be crucial for omnichannel measurement, flexibility, and speed.\n\n*Key takeaways and highlights from our interview with Harish Rao, Global VP of Data and Analytics for Costco Wholesale:*\n\n→ “Costco's philosophy is to think about continuous improvement. This partnership is not just, ‘scale and you’re done.’ It’s about continuous innovation to deliver superior member experience. That is who we are at Costco, and that applies to everything.” \n\n→ “The digital transformation journey is nothing generic that you can pick from. It all depends on your core values and core principles. We go back to our core value proposition of delivering superior member experience, delivering great product and great value. This is a great opportunity for Costco to look at a complete 360-degree view of our members.”\n\n→ “The expectation is to double the company over the next decade. Imagine when you’re a $500 billion enterprise, what does that really look like? The business model is not just to drive a broader revenue model. It goes back to how we drive more value to our members and suppliers.”\n\n*Google Cloud products used:* Vertex AI, Gemini, BigQuery, Bigtable\n\n*Learn more:*\n\n→ Accenture’s Enterprise CTO: “Gen AI really changes how we interact with all kinds of work” https://cloud.google.com/transform/accentures-enterprise-cto-gen-ai-changes-how-we-interact-with-all-kinds-of-work\n\n→ Empowering retailers with AI for commerce, marketing, supply chains, and more https://cloud.google.com/blog/topics/retail/retail-cpg-ai-partner-ecosystem-nrf-2025 \n\n→ Realize the True Potential of Omnichannel https://cloud.google.com/files/apigee/apigee-realize-true-potential-of-omnichannel-ebook.pdf",
        "published_date": "2025-11-07 00:22:16"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=foXQKYDprTo",
        "title": "ANOf: The Autonomous Network. Now.",
        "thumbnail": "https://www.youtube.com/v/foXQKYDprTo?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "The future of network operations isn't just automation, it's autonomy. This is ANOf: a \"digital workforce\" of coordinated AI agents that predict faults, diagnose root causes, and resolve issues. See the self-healing, self-optimizing network in action.",
        "published_date": "2025-11-06 20:20:54"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=zJKp8xVmX2A",
        "title": "Get real-world evidence at your fingertips",
        "thumbnail": "https://www.youtube.com/v/zJKp8xVmX2A?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Atropos Health on Google Cloud rapidly generates real-world evidence for your clinical questions. This can help you advance precision medicine - whether for complex patient care or drug discovery and development. Get answers you can trust with our transparent methodology and keep your data within your own firewall.",
        "published_date": "2025-11-06 14:01:46"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=coPKHrE2ATI",
        "title": "Google Cloud unboxes seventh generation Ironwood TPU",
        "thumbnail": "https://www.youtube.com/v/coPKHrE2ATI?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Amin Vahdat, VP & GM of AI and infrastructure at Google Cloud, takes you inside the Google TPU lab before an unboxing of our seventh generation TPU, Ironwood.",
        "published_date": "2025-11-06 13:01:19"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=FKOW91QQCA4",
        "title": "Google Custom Silicon: Meet Ironwood TPUs & new Axion VMs",
        "thumbnail": "https://www.youtube.com/v/FKOW91QQCA4?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Get the highlight from our recent keynote: We're excited to announce two major updates to the Google Cloud compute portfolio.\n- Ironwood TPU Platform: Our 7th-generation, most powerful, and energy-efficient TPU, purpose-built for high-performance inference and model serving.\n- New Arm®-based Axion instances: N4A, our most cost-effective N series virtual machine to date, is now in preview. N4A offers up to 2x better price-performance than comparable current-generation x86-based VMs. We are also pleased to announce C4A metal, our first Arm-based bare metal instance, will be coming soon in preview.\n\nTo learn more, read the announcement article: https://g.co/cloud/ironwood-axion",
        "published_date": "2025-11-06 13:00:34"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=aQxcomQDHcw",
        "title": "Announcing Ironwood TPUs General Availability and new Axion VMs to power the age of inference",
        "thumbnail": "https://www.youtube.com/v/aQxcomQDHcw?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Join Mark Lohmeyer, VP/GM of AI and Computing Infrastructure at Google Cloud, as he introduces the next generation of AI infrastructure, co-designed to meet the challenges of the \"age of inference.\"\nThis video unveils two major updates to the Google Cloud compute portfolio: the Ironwood TPU platform and new Axion Arm-based processors.\n\nLearn how Ironwood, our 7th-generation TPU, delivers breakthrough performance and energy efficiency for large-scale model serving and training. Mark details how Ironwood functions as a complete system—part of our AI Hypercomputer—with innovations in networking (ICI & OCS), liquid cooling, and software (vLLM, GKE Inference Gateway).\n\nThen, discover how the new N4A and C4A.metal Axion VMs provide price-performance for the general-purpose workloads that support your AI applications, from data preprocessing to web serving.\nSee how Google's full-stack, co-designed approach is delivering efficiency gains and powering the future of AI for customers and for Google's own products like Gemini, Search, and YouTube.\n\nTo learn more, read the announcement article: https://g.co/cloud/ironwood-axion",
        "published_date": "2025-11-06 13:00:04"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=ab6UudZxqak",
        "title": "Transform Products into Stunning 3D Visuals with Imagine.io & Google Cloud",
        "thumbnail": "https://www.youtube.com/v/ab6UudZxqak?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Ignite your brand's potential with Imagine.io and Google Cloud! Our Visual Scale solution offers the fastest path to high-quality, 3D visuals at scale, powered by generative AI.\n\nBoost sales and accelerate market agility for every product. Generate stunning, photorealistic lifestyle images in seconds from basic product shots or CAD data. Google Gemini helps us understand your products to create compelling imagery for e-commerce and omnichannel marketing.\n\nRevolutionize visual creation:\n\n-Launch products faster by slashing months off your go-to-market timeline.\n-Boost online conversions and streamline omnichannel marketing.\n-Speed up development by visualizing concepts without physical prototypes.\n\nSee how GenAI transforms basic product shots into scroll-stopping content.\n\nVisit http://imagine.io to learn more!",
        "published_date": "2025-11-05 14:00:04"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=c3WSg0Bpmt4",
        "title": "Conversational Analytics API",
        "thumbnail": "https://www.youtube.com/v/c3WSg0Bpmt4?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Get started today by following our documentation and unlock the speed of AI for your data: https://cloud.google.com/gemini/docs/conversational-analytics-api/overview\n\nThe Looker Conversational Analytics API provides a transformative way to interact with data, moving beyond traditional dashboards by allowing users to ask questions in natural language (like \"Show me top-selling products last quarter\"). Powered by Gemini for Google Cloud, the API leverages the Looker semantic layer (LookML) to ensure that every query is accurate, governed, and based on consistent business definitions, thus acting as a single source of truth. This technology empowers developers to embed trusted, AI-powered analytics directly into custom applications, internal portals, or workflows—eliminating context switching, democratizing data access, and ultimately accelerating the speed at which organizations can make reliable, data-driven decisions.",
        "published_date": "2025-11-05 05:01:00"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=w-lRv6ldpt4",
        "title": "Salesforce and Google Cloud Help Simplify Account Management for Berlin Packaging",
        "thumbnail": "https://www.youtube.com/v/w-lRv6ldpt4?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Learn more about the Salesforce and Google Cloud partnership: https://goo.gle/4nHC4zo\n\nWatch how Berlin Packaging streamlines sales operations with Salesforce Agentforce and Google Gemini.",
        "published_date": "2025-11-04 21:07:29"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=cqXFlPAnTjA",
        "title": "Salesforce and Google Cloud Help Harvey Nichols Personalize at Scale.",
        "thumbnail": "https://www.youtube.com/v/cqXFlPAnTjA?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Learn more about the Salesforce and Google Cloud partnership: https://goo.gle/4nHC4zo\n\nWatch how Harvey Nichols transforms customer loyalty with Salesforce Data 360 and Google BigQueary.",
        "published_date": "2025-11-04 17:01:15"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=eY58H1B_8Zs",
        "title": "New Way Now: Mobile services get smarter at LG U+ with help from Google AI",
        "thumbnail": "https://www.youtube.com/v/eY58H1B_8Zs?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "*Featured in this video:* SeokYoung Lee, Director, Head of Mobile Agent Services at LG U+\n\n*Executive summary:* Mobile network operator LG U+ chose Google Cloud AI to enhance on-device features for its more than 18 million subscribers across South Korea. As LG U+ continually works to bring customers convenient, easy-to-use mobile devices, they’ve used Gemini and Vertex AI to add call summarization, visual call interfaces, spam detection, and AI call answering for users. In the competitive telecom market, and as LG U+ prepares for international expansion, the company chose Google AI products to differentiate its services and grow revenue. \n\n*Challenge:* LG U+ aimed to expand its services beyond South Korea, but needed to add to its existing capabilities quickly to serve users in real time with helpful, convenient AI features.\n \n*Solution:* The mobile agent services team integrated Gemini into its ixi-O phone agent for more actionable AI that can understand user intent and respond accordingly. The LG U+ ixi-O One agent pairs its own device AI — which transcribes and records calls in real time — with Gemini, which performs sophisticated analysis to summarize conversations and suggest follow-up actions. Next, the mobile agent team will use Vertex AI to add features that recommend responses during calls based on content searches, as well as retrieve relevant locations, objects and contextual information. \n\n*Results:* With newly expanded AI capabilities, LG U+ will expand internationally, partnering with both Google and other telecom companies. The team’s plans for the coming year include building even deeper data-driven customer understanding into its products and creating an advanced autonomous agent. \n\n*Key takeaways and highlights from our interview with SeokYoung Lee, Director, Head of Mobile Agent Services at LG U+:*\n\n→ “Our team’s motto is ‘turning imagination into reality.’ Google plays two key roles in this: first is enhancing our imagination, and second is providing practical technologies and solutions that make our ideas real.” \n\n→ “At LG U+, gen AI and Vertex AI are helping us with a smarter call agent, ixi-O. The problems we aim to solve with ixi-O One were not new, but solving them with AI was incredibly exciting.”\n\n→ “AI allows everyone to start again from the same starting line. Even large businesses can be completely transformed by AI. Telecom companies have been offering similar services, but AI can create entirely new differentiation.”\n\n→ “The most valuable benefit we get from collaborating with Google is that Google has a complete stack of AI. For example, Google Cloud has AI Hypercomputer and research and models and also has Vertex AI to build an agile agent.”\n\n*Google Cloud products used:* Gemini, Vertex AI\n\n*Learn more:*\n\n→ The AI-driven telecom: A new era of network transformation https://cloud.google.com/blog/topics/telecommunications/the-ai-driven-telecom-a-new-era-of-network-transformation\n\n→ Next ’25 recap: Telecommunications https://cloud.google.com/transform/telco-next25-wrapup-telco-cloud-news \n\n→ Here to serve Korea’s businesses with a new GCP region in Seoul\nhttps://cloud.google.com/blog/products/infrastructure/new-gcp-region-in-seoul",
        "published_date": "2025-11-04 01:00:51"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=CT-ib9oU_EM",
        "title": "Supercharging Generative Voice AI: Resemble AI + Google Cloud Managed Lustre",
        "thumbnail": "https://www.youtube.com/v/CT-ib9oU_EM?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Zohaib Ahmed, CEO and Teddy Papajorgji, VP Engineering at Resemble.AI share how Resemble.AI is accelerating their generative AI model training times by saturating their GPUs with Google Cloud Managed Lustre. Learn how Resemble.AI was able to reduce training time and costs, and deliver a better experience to their customers.\n\nLearn more about Google Cloud Managed Lustre here → https://goo.gle/4p3sl7J",
        "published_date": "2025-11-03 18:42:45"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=6f0BWkXx970",
        "title": "Beyond Gemini: Your complete guide to AI on Google Cloud",
        "thumbnail": "https://www.youtube.com/v/6f0BWkXx970?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Are you feeling overwhelmed by the non-stop pace of AI innovation? It feels like the AI landscape changes every day! This video introduces the essential course, \"Introduction to AI and Machine Learning on Google Cloud,\" designed to take you from confusion to confident creation. We break down the complex world of AI, showing you how to pick up the most powerful tools Google Cloud has to offer—no coding genius required!\n\nEnroll to become an AI expert → https://goo.gle/47Sf2kw\n\nThis course breaks down complex concepts into simple, practical steps, making predictive and generative AI accessible to everyone. Whether you're expanding your professional skills or just curious about the future, your AI journey starts here.",
        "published_date": "2025-11-03 15:34:08"
    },
    {
        "website": "YOUTUBE_GOOGLE_CLOUD",
        "link": "https://www.youtube.com/watch?v=i4SoM_FG9HE",
        "title": "How Yoodli trained 15,000 people with Google Cloud Consulting",
        "thumbnail": "https://www.youtube.com/v/i4SoM_FG9HE?version=3",
        "author": "Google Cloud",
        "track": null,
        "description": "Ready to disrupt your industry? Google Cloud Consulting can show you how…https://goo.gle/3ZoyVem\n\nSee how Yoodli, an AI-powered communication coach, partnered with Google Cloud Consulting to deliver one of the biggest corporate training programs in Google's history. Varun Puri, CEO and co-founder of Yoodli, explains how they trained 15,000 people—a task that would have taken six months with traditional methods—by building personalized and customized AI role-play scenarios. Discover how Google Cloud Consulting provided early access to Gemini and expertise from the model garden to create a scalable, AI-driven learning solution.\"",
        "published_date": "2025-11-03 13:01:26"
    }
]