[
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=m8ZmF1P4Z58",
        "title": "Andrew Zimmern & Barton Seaver | The Blue Food Cookbook | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/m8ZmF1P4Z58?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Emmy-winning and four-time James Beard Award-winning TV personality, chef and writer Andrew Zimmern and one of the world’s leading sustainable seafood experts and educators Barton Seaver discuss their cookbook “The Blue Food Cookbook: Delicious Seafood Recipes for a Sustainable Future,” a sustainable seafood bible, including a guide to environmentally friendly practices for buying and cooking food from oceans, lakes, and rivers, with over 145 recipes. \n\nGet the book here: https://goo.gle/47zKnbt.  \n\nAndrew Zimmern is an Emmy-winning and four-time James Beard Award-winning TV personality, chef and  writer. As the creator, executive producer, and host of the Bizarre Foods franchise, MSNBC’s What’s Eating America, Magnolia Network’s Emmy-nominated Family Dinner, the Emmy-winning The Zimmern List, Field to Fire, Wild Game Kitchen, and the executive producer of PBS’s Hope in the Water, he has devoted his life to exploring and promoting cultural acceptance, tolerance, and understanding through food. He has authored four books, sits on many national boards, and is a global ambassador for the United Nations World Food Programme and the International Rescue Committee.\n\nBarton Seaver is one of the world’s leading sustainable seafood experts and educators. Before leaving the restaurant industry to pursue his interests in sustainable food systems, he was an award-winning chef leading top seafood restaurants in Washington, DC. He has written seven seafood-centric books, including For Cod and Country and The Joy of Seafood. Barton has contributed to Coastal Living, The Coastal Table, Cooking Light, Every Day with Rachael Ray, Fine Cooking, Fortune, Martha Stewart’s Whole Living, The New York Times, O: The Oprah Magazine, Saveur, The Washington Post, among many others. He has appeared on 60 Minutes,\nCNN, NPR, 20/20 and the TED stage. Seaver hosted In Search of Food on the Ovation Network and Eat: The History of Food on National Geographic TV.\n\nModerated by Jessica Carless.",
        "published_date": "2025-11-13 17:01:28"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=TpT37dWYG6I",
        "title": "Brie Larson & Courtney McBroom | Party People | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/TpT37dWYG6I?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Award-winning actress Brie Larson and fellow party person and former Milk Bar culinary director Courtney McBoom discuss “Party People: A Cookbook for Creative Celebrations.” Celebrate any occasion (really, any occasion!) with 100 creative recipes inspired by community and celebration and endless ideas for your next party. \n\nGet the book here: https://goo.gle/47SUEQV. \n\nAbout the panelists:\n\nBrie Larson is an actress, director, and producer, best known for her 2016 Academy Award-winning performance in Room. The critically acclaimed role also netted Larson a Golden Globe, Screen Actors Guild, BAFTA, Critics' Choice, EMMY and National Board of Review awards.\n\nIn 2023, she executive produced and starred as Elizabeth Zott in Apple TV+’s Lessons in Chemistry, earning Emmy, Screen Actors Guild, Critics' Choice, and Golden Globe nominations. Past credits include the titular role in Captain Marvel which broke box office records, and its sequel, The Marvels, in addition to Fast X, Trainwreck, Kong: Skull Island, The Glass Castle and her breakout role in 2013’s Short Term 12. The latter earned Brie Best Actress awards at Locarno and Gotham. She has been named one of TIME 100's Most Influential People.\n\nCourtney McBroom is a party person, a chef, a culinary producer, and the author of the cookbooks Divine Your Dinner, All About Cake, Momofuku Milk Bar, and Milk Bar Life. She is the former culinary director of Milk Bar, a celebrated dessert and bakery brand, and the founder of Ruined Table, a publishing and event series about dinner parties. Recently, she was the head food consultant for Lessons in Chemistry on Apple TV+. She has been a guest on shows such as Chef’s Table, Mind of a Chef, Vice Munchies, and Bong Appétit, and her writing and recipes have been featured in Food & Wine, Vice, GQ, InStyle, Thrillist, Stylist, and Lucky Peach magazine.\n\nModerated by Kevin Allocca, Global Director of Culture & Trends at YouTube",
        "published_date": "2025-11-04 17:01:00"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=JwkEL0QAFFc",
        "title": "Broadway's Buena Vista Social Club | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/JwkEL0QAFFc?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Mel Semé, Jainardo Batista Sterling, Isa Antonetti, Da’von T. Moody And Wesley Wray perform and discuss the Tony Award-winning Broadway musical, Buena Vista Social Club. \n\nInspired by true events, the musical brings the thrilling GRAMMY® Award-winning album to life, recounting the story of the legends who lived it. Step into the heart of Cuba, beyond the glitz of the Tropicana, to a place where blazing trumpets and sizzling guitars set the dance floor on fire. A world-class Afro-Cuban band and a sensational cast unite in this unforgettable tale of survival, second chances, and the extraordinary power of music.\n\nLearn more about the show: https://buenavistamusical.com/. \n\nAbout the panelists: \n\nMel Semé (Ibrahim) was born and raised in Camagüey, Cuba. His passion for music led him to the prestigious University of Arts in Havana. He now divides his time between Barcelona, Los Angeles, and New York’s vibrant theatre scene. Influenced by Cuban rhythms, pop, folk, and jazz, his music is a captivating blend. With a sultry voice and masterful multi-instrumentalist skills, Mel transcends borders, uniting audiences worldwide. His music is a bridge between cultures, showcasing the unifying power of melody.\n\nJainardo Batista Sterling (Rubén) is a Puerto Rican singer and percussionist. He comes from a family with a long tradition in music and theater in Puerto Rico. As a Jazz Ambassador of Jazz at Lincoln Center, he has toured Central and Northwest Africa as well as South America and the Caribbean. Additionally, he has performed in the Jerusalem Jazz Festival with Roman Diaz and Grupo Agolona; Essaouira Gnawa Festival (Morocco) with Colette Michaan’s Querencia; and Grammy-nominated Raices Haberas at New York’s Town Hall. Jainardo maintains an active performance schedule in NYC.\n\nIsa Antonetti (Young Omara) (she/her/ella) is overjoyed and humbled to be making her Broadway Debut in Buena Vista Social Club! She is a Latinx, Indigenous, Mixed Race LGBTQIA+ actress and singer from the Greater Rochester, New York area. She is currently completing her BFA in Musical Theatre at Carnegie Mellon University. Previous credits include Evita (NYCC), Macbeth (CMU), and A Chorus Line (OFC Creations). She also stars as the lead in her film debut, Gift of Fear (On Native Ground). Making her debut in Buena Vista Social Club is especially meaningful for Isa, as it reflects her own experiences growing up performing with her father’s Latin band, Orquesta Antonetti. For Isa, music is synonymous with family, and this milestone is a tribute to everyone who has been a part of her journey. \n\nDa’Von T. Moody (Young Compay) is making his Broadway Debut with Buena Vista Social Club but has also had the pleasure of being a part of many other projects. National Tour: MJ the Musical (Alejandro). Off-Broadway: Man of No Importance. Regional credits include: The Outsiders (Dallas Winston) at La Jolla Playhouse, RENT (Benny) at the Signature Theatre, Gun & Powder (World Premiere), Ain’t Misbehavin’. Olney Theatre: A.D. 16- World Premier (Simeon); Ford’s Theatre: The Wiz, Christmas Carol, Amazing Grace (Mr. Tyler); Constellation Theatre: Aida! (Mereb); ArtsCentric: Hair (Berger) and Dreamgirls (C.C. White). Film: Once Again for the First Time. \n\nWesley Wray (Young Ibrahim) is making his Broadway Debut in Buena Vista Social Club. BFA Musical Theatre student at the University of Michigan (class of ‘26) and proud native of Miami, Florida. Wesley is a member of the Peter London Global Dance Company, celebrated for its distinctive Afro-Caribbean movement style. Wesley’s extensive training includes studying at the Alvin Ailey School, where he honed his skills in Martha Graham, Lester Horton, and ballet techniques. He further developed his classical acting at the Royal Academy of Dramatic Art, where he not only performed as Amiens and Silvius in Shakespeare’s As You Like It, but also composed the music for the production. While attending Michigan, Wesley has been seen in A Chorus Line (Mike Costa), Guys and Dolls (Harry the Horse), and most recently in Shaina Taub’s Twelfth Night (Duke Orsino). His most notable film credit includes working as a stand-in for Little in the Oscar-winning film Moonlight. Wesley is thrilled to make his Broadway debut, originating a role in such a beautiful, culturally enriching production. He is deeply grateful to his community for supporting him in reaching this dream. \n\nModerated by Patricia Hadden.",
        "published_date": "2025-10-28 16:00:39"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=AT-kLjXxn7A",
        "title": "Dr. Pria Anand | The Mind Electric | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/AT-kLjXxn7A?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Neurologist and author Dr. Pria Anand joins us to discuss her book “The Mind Electric: A Neurologist on the Strangeness and Wonder of Our Brains,” in which she demonstrates the compelling paradox at the heart of neurology: that even the most peculiar symptoms can show us something universal about ourselves as humans.\n\nGet the book here: https://goo.gle/4ogUZT3. \nLearn more about Pria: https://www.priaanand.com/. \n\nPria Anand is a neurologist at the Boston Medical Center and an Assistant Professor at the Boston University School of Medicine. She is a graduate of Yale University and Stanford Medical School, and she trained in neurology, neuro-infectious diseases, and neuroimmunology at the Johns Hopkins Hospital and the Massachusetts General Hospital.\n\nModerated by Lucy Boyd Schachter.",
        "published_date": "2025-10-01 16:00:31"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=GWVSeLEcBm4",
        "title": "Patrick Mouratoglou | Champion Mindset | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/GWVSeLEcBm4?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Legendary tennis coach, Patrick Mouratoglou, joins us to discuss his book Champion Mindset: Coach Yourself to Win at Life, where he distills his lifetime of coaching excellence into ten commandments applicable to achieving success in all aspects of life, not just the court.\n\nGet the book here: https://goo.gle/3Uz8Qq7. \nLearn more about Patrick: https://www.patrickmouratoglou.com/. \n\nPatrick Mouratoglou is one of the world’s most famous and respected tennis coaches. Under Patrick’s guidance, his players have won ten Grand Slam titles, two Olympic gold medals, and over 40 singles championships. Mouratoglou Academy, based in the south of France and with satellites around the globe, is widely regarded as one of the world’s premier tennis academies. Beyond coaching, he has been featured in The Playbook on Netflix, and is a regular TV consultant and social media sensation, with millions of followers on Instagram, TikTok, and YouTube who eagerly engage with his tennis tips, match analysis, and insights shared with the tennis community.\n\nModerated by Zara Brownless.",
        "published_date": "2025-08-27 16:00:30"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=Kz1dXcs8zMY",
        "title": "The Co-Intelligence Revolution: How Humans and AI Co-Create New Value | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/Kz1dXcs8zMY?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Authors Venkat Ramaswamy & Krishnan Narayanan join us to discuss their book The Co-Intelligence Revolution: How Humans and AI Co-Create New Value. We stand at the dawn of a new industrial revolution—not one defined by automation and substitution of human intelligence, but by co-intelligence, where human ingenuity and AI (as a different kind of intelligence) collaborate in ways never before imagined. \n \nTheir book demonstrates this call to action to co-create a world where intelligence emerges from the interactive, ever-evolving relationships between humans, AI, and ecosystems.\n\nGet the book here: https://goo.gle/4dRKOzE. \n\nVenkat Ramaswamy is a professor at the Ross School of Business, University of Michigan, contributing to innovation, strategy, marketing, branding, IT, operations, and organizational behaviour. His scholarly work (over 40,000 Google Scholar citations) and practical ideas have earned global recognition. In 2004, alongside C.K. Prahalad, he introduced the idea of Co-Creation in the bestseller, The Future of Competition, reshaping value generation through interactive experiences and collaboration. His ideas evolved into transformative practices leveraging digital engagement platforms and multi-stakeholder interactions, detailed further in The Power of Co-Creation (2010) and The Co-Creation Paradigm (2014). Venkat holds degrees from the Wharton School of University of Pennsylvania and IIT Madras.\n\nKrishnan Narayanan is the co-founder and president of itihaasa Research and Digital, where he studies emerging technologies and innovations. Previously, he was a member of the Infosys Labs Management Council. He is an award-winning author of Against All Odds - The IT Story of India (2022) and Empowering India – Ideas for Action by Scientists and Engineers (2023), and has co-chronicled one of the world’s largest oral histories of Indian IT. Krishnan serves as founding Board member of AquaMAP water centre, advisor to the Global Learning Council, and teaches & researches at IIT Madras and its Centre for Responsible AI. Krishnan holds degrees from IIT Madras and XLRI Jamshedpur.\n\nModerated by Sharath Bulusu.",
        "published_date": "2025-07-23 16:00:38"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=esA0vZZe6wk",
        "title": "Alfredo Garcia | Let's Make It!: A Mexican-American Culinary Adventure | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/esA0vZZe6wk?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Chef and content creator Alfredo Garcia joins us to discuss his book “Let's Make It!: A Mexican-American Culinary Adventure,” which reflects the dual influences on his cooking, with Mexican-inspired versions of American classics and modern twists on traditional dishes. \n\nWhether you’re looking for a fresh twist on tres leches cake (try a bit of matcha powder!) or the most delectable pico de gallo to bring to the carne asada, Let’s Make It has got you covered.\n\nGet the book here: https://goo.gle/42WHkbg.  \nLearn more about Alfredo: https://www.freddsters.com/. \n\nAlfredo Garcia, born in the Rio Grande Valley of Texas and raised in Chicago, has been a full-time content creator since 2021. Before that, he was a private chef for multiple MLB players. His love of cooking is inspired by the strong women in his family, especially his mother, grandmother, and aunts. He'd watch them as they’d make chilaquiles (easily his all time favorite meal), tacos, and every kind of salsa you can imagine. \n\nModerated by Jina Moore Ngarambe.",
        "published_date": "2025-07-01 16:01:08"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=XrpADTRwRS8",
        "title": "B. Dylan Hollis | Baking Across America: A Vintage Recipe Road Trip | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/XrpADTRwRS8?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "New York Times bestselling author and social media personality, B. Dylan Hollis, discusses  his book “Baking Across America: A Vintage Recipe Road Trip,”—a cross-country culinary journey with 100 uniquely American recipes.\n\nFollow Dylan’s journey through the culture capitals of America to savor the very best bakes the nation has to offer. His retro recipes span the decades from the 1900s to the 2000s and feature famous (and forgotten) desserts from every state.\n\nGet the book here: https://goo.gle/4ir13VG. \n\nB. Dylan Hollis is a social media personality who has tasked himself with baking and tasting unusual recipes from bygone years. Born and raised on the island of Bermuda, he later attended college at the University of Wyoming to further a career as a jazz pianist and arranger. He stumbled into both baking and social media fame at once in 2020, when quarantine boredom led him to film an investigation of an old cookbook he had collected from an estate sale. Hundreds of recipes later, Dylan now entertains millions across TikTok, YouTube, and Instagram with his unique style and fast jokes.\n\nModerated by Lilah Jones.",
        "published_date": "2025-06-28 16:01:01"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=G4IdW8daReE",
        "title": "Tu David Phu | The Memory of Taste | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/G4IdW8daReE?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Top Chef Alum Tu David Phu joins us to discuss his book “The Memory of Taste: Vietnamese American Recipes from Phú Quoc, Oakland, and the Spaces Between,” a playful collection of over 85 Vietnamese and Viet American dishes and immersive travel photography that blends the Oakland native’s modern culinary style with the food wisdom from his refugee family.\n\nIt's Chef Tu’s story of returning to his roots and finding long-hidden culinary treasure. \n\nGet the book here: https://goo.gle/438IIYo.  \nLearn more about Chef Tu: https://cheftu.com/. \n\nChef Tu David Phu, a San Francisco Chronicle Rising Star Chef and chef-partner at GiGi’s, a Vietnamese-inspired wine bar in San Francisco, draws from his Oakland upbringing and his family’s artisanal fish sauce legacy from Phu Quoc, Vietnam.\n\nHis culinary path began in his mother’s Oakland garden and developed in prestigious kitchens like New York’s Daniel and San Francisco’s Acquerello, where he was surrounded by the team that earned two Michelin stars. This journey inspired his Vietnamese-Californian pop-up Ăn and his Rising Star Chef honor in 2017.\n\nBeyond the kitchen, Chef Tu shares his family’s story through the Emmy-nominated PBS film Bloodline and his cookbook The Memory of Taste, co-authored with James Beard Award-winner Soleil Ho.\n\nModerated by Oskar Yao.",
        "published_date": "2025-06-26 16:00:26"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=gDNJYKE5S84",
        "title": "Broadway's Stranger Things | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/gDNJYKE5S84?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Gabrielle Neveah, Alison Jaye, Burke Swanson & Juan Carlos join us to discuss Broadway’s Stranger Things: The First Shadow – the global phenomenon that comes to life on stage in an award-winning, jaw-dropping spectacle. \n\nThe show astonished the West End, winning the Olivier Award for Best Entertainment, the WhatsOnStage Award for Best New Play, the Critics' Circle Theatre Award for Best Designer, among others. Critics hailed it as “a game-changing experience” (Daily Telegraph) that makes the unimaginable real and “takes theater to the next dimension” (The Observer). \n\nLearn more about Stranger Things: The First Shadow: https://broadway.strangerthingsonstage.com/. \n\nAbout the panelists:\n\nGabrielle Nevaeh (Patty Newby) is an actress, producer, and voice-over artist known for her work in television, film, and sports media. She gained recognition as the star of Nickelodeon’s “That Girl Lay Lay,” making history with the network’s first series featuring two Black female leads. The show achieved record-breaking ratings and marked a milestone in representation. Gabrielle also made history as the first woman and first Black woman to call an NFL Wildcard Game on CBS. She’s hosted major events like the 2022 Kids’ Choice Awards, the Nickelodeon Slime Cup, and “Nick News.” As a voice artist, Gabrielle voices Clawdeen Wolf in “Monster High” and stars in Gremlins: Secrets of the Mogwai and Curses for DreamWorks. Her career has earned critical acclaim, including multiple Kids’ Choice Award nominations, an Emmy nomination for “Nick News,” and a Young Artist Academy Award for “All That.”\n\nAlison Jaye (Joyce Maldonado) A native New Yorker, Alison Jaye began her Broadway career as Louise in Stephen Sondheim’s revival of Sunday in the Park with George, and later appeared as Jane Banks in Disney’s Mary Poppins. She gained recognition as Julia Nicolo in “Shameless” (season 10) and appeared alongside Sigourney Weaver and Elizabeth Banks in Call Jane. Alison recently starred in ABC’s acclaimed new series, “High Potential,” led by Kaitlin Olson. She earned a BAFTA nomination for her role as “Alva” in PlayStation’s “Horizon: Forbidden West.” \n\nBurke Swanson (James Hopper, Jr.) made his Broadway debut months following his graduation from the Savannah College of Art & Design. Taking on the role of ‘Jack’ in the Roundabout Theater Company’s revival of Tennessee Williams’ The Rose Tattoo, Burke had the opportunity to work alongside Oscar winners and Drama League recipients. Next up came the recurring role of ‘Brad’ in Amazon’s first season of “Harlem,” and most recently you may have caught him traveling the country as everyone’s favorite dad, George McFly, in the First National Tour of Back to the Future: The Musical. When he isn’t acting, Burke is creating experimental art as part of JMP! Collective, playing D&amp;D / TTRPGs with his friends, doing bad contour drawings in the park, and getting lost with his family in the mountains. Any mountain, as long as there is no cellular connection. \n\nJuan Carlos (Bob Newby) making his Broadway debut! With a resume that includes standout roles on shows such as ABC’s Grey's Anatomy, The Better Sister with Elizabeth Banks and Jessica Biel on Prime Video, HBO’s Sex Lives of College Girls, as well as working opposite the legendary Matthew Broderick in Elsbeth on CBS, Juan brings a wealth of passion and joy to the Broadway stage. \n\nModerated by Chirag Nijjer.",
        "published_date": "2025-06-18 16:01:09"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=hlO4AKUOAok",
        "title": "Zarna Garg | This American Woman: A One-In-A-Billion Memoir | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/hlO4AKUOAok?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Award-winning comedian Zarna Garg discusses her book “This American Woman: A One-In-A-Billion Memoir” – an exuberant story of fighting for your right to determine your own destiny and triumphing beyond what you ever dreamed was possible. Zarna’s mantra becomes a call to action: It’s never too late. If Zarna can do it, you can, too.\n\nZarna’s memoir tells the story of her treacherous climb from a homeless teen in Mumbai to an unhinged stay-at-home mom in New York and then to an internationally beloved stand-up comedian.\n\nGet the book here: https://goo.gle/4jVv6p6.  \nLearn more about Zarna: https://zarnagarg.com/. \n\nZarna Garg is a force of nature with a microphone. This Indian immigrant mom brought her sharp, relatable family humor to her first streaming special, ‘One in a Billion.’ Her follow-up special ‘Practical People Win’ is coming from Hulu in July. When Zarna’s not slaying at the Comedy Cellar or opening for icons like Tina Fey and Amy Poehler, she’s selling out headlining shows worldwide. Zarna’s Tonight Show and Late Night interviews are among the most watched online. She made her acting debut in ‘A Nice Indian Boy,’ currently out in theaters and a New York Times Critic’s Pick (calling Zarna “a standout”). Her hugely popular ‘Zarna Garg Family Podcast’ explores modern family life with her husband and kids. With millions of social media followers and billions of views, Zarna just can’t stop laughing her way to the top.\n\nModerated by Erica Bigley.",
        "published_date": "2025-06-14 16:01:05"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=m5zx248Hmw8",
        "title": "Luke Wilson, Ana Villafañe & Jimmy Canton | The Hole in the Wall Gang Camp | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/m5zx248Hmw8?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Advocate and actor Luke Wilson, Board Member and Broadway, film and TV star Ana Villafañe & Chief Executive Officer Jimmy Canton discuss The Hole in the Wall Gang Camp and its mission. Founded in 1988 by legendary actor and visionary philanthropist Paul Newman, the camp provides “a different kind of healing” to thousands of children with serious illnesses and their family members annually completely free of charge. \n\nFor many of these children and families, Hole in the Wall provides multiple Camp experiences throughout the year at the facility in Ashford, Connecticut, in dozens of hospitals and clinics, directly in camper homes and communities, and through other outreach activities across the Northeast and Mid-Atlantic.\n\nLearn more about The Hole in the Wall Gang Camp: https://www.holeinthewallgang.org/. \n\nAbout the panelists:\n\nJimmy Canton is the CEO of The Hole in the Wall Gang Camp, an organization he has been with since its 1988 founding. Rising from counselor through roles including Camp Director, he led the development of year-round and hospital outreach programs. Under his leadership, the camp grew from serving 288 children in its first summer to over 20,000 children and family members annually. Canton has also contributed to the global SeriousFun Children's Network's program development and camp launches. He holds a BA from Stanford and a Master's in Theology from Yale Divinity School.\n\nAna Villafañe is a Board Member of The Hole in the Wall Gang Camp. She is an accomplished actress who recently starred opposite Holland Taylor in the world premiere of N/A at Lincoln Center and plays the title character in upcoming feature film Castro’s Daughter. Villafañe made a notable Broadway debut originating the role of Gloria Estefan in On Your Feet, earning Drama League and Theatre World Awards. She returned to Broadway post-pandemic as Roxie Hart in Chicago, portrayed Nina Rosario in the Kennedy Center's In the Heights, and received her second Drama League Award for MCC’s Collective Rage. TV credits include New Amsterdam and Younger, both on Netflix. Recognized by the New York Times (\"30 under 30\") and honored for advancing Latin representation, the Cuban-Salvadoran actress will next embody Ava Gardner in Sinatra; the Musical on Broadway.\n\nLuke Wilson is an advocate for The Hole in the Wall Gang Camp. He began his acting career in 1994 with Bottle Rocket, collaborating with Wes Anderson and Owen Wilson on films like Rushmore and The Royal Tenenbaums. He's known for iconic comedies such as Legally Blonde, Old School, and Idiocracy, working with numerous comedians including Will Ferrell. Wilson's work extends to television (collaborating with Mike White, Vince Gilligan) and projects involving musicians like Bob Dylan. He also writes and directs, having co-directed The Wendell Baker Story and written the short Satellite Beach, with more projects upcoming. Recently, he starred in films like 12 Mighty Orphans, You Gotta Believe, Kevin Costner’s Horizon, and the Netflix series No Good Deed.\n\nModerated by Mike Abrams.",
        "published_date": "2025-06-10 15:01:17"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=o9EXAJOxFIE",
        "title": "Moritz Baier-Lentz | Investor Perspectives: Igniting Growth with AI | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/o9EXAJOxFIE?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Senior Partner and the Head of Gaming & Interactive Media at Lightspeed Venture Partners, Moritz Baier-Lentz, discusses investment themes and current market trends at the intersection of gaming and AI. \n\nMoritz explores the impact of AI on the industry, drawing on his unique journey from top Diablo II player to leading venture capitalist.\n\nLearn more about Moritz: https://lsvp.com/team-member/moritz-baier-lentz/. \n\nLightspeed is a globally leading venture capital firm with 13 offices, more than $29 billion in assets under management, and over 200 exits across the U.S., Europe, and Asia. In 2023 and 2024, founders selected Lightspeed as the #1 lead investor in the gaming industry.\n\nMoritz hosts the annual CEO Forum at GDC—the world's leading gathering of gaming & AI CEOs—and is an investor and board member to founders who led the creation of multi-billion platforms, technologies, and IP franchises like Fortnite, Call of Duty, or League of Legends. Prior, Moritz was a partner and management team member at BITKRAFT, personally raised $200 million and helped scale the firm to $850 million. Previously, Moritz was a top-ranked vice president at Goldman Sachs, where he founded and led the firm’s global gaming practice. A lifelong gamer, Moritz spent his teenage years competitively playing Blizzard’s Diablo II, culminating in a global #1 ranking among over 12 million players in 2003. The first in his family to graduate high school, he traded the digital swords and armor that he earned in-game to afford his college tuition—two decades before digital asset trading entered the mainstream.\n\nMoritz holds an M.B.A. and M.A. from Stanford, where he graduated as Arjay Miller Scholar and ERP Scholar (“German Rhodes”). He was recognized among the “30 Under 30” (Forbes), “40 Under 40” (Capital), “Young Leaders” (Atlantik-Brücke), and “Young Global Leaders” (World Economic Forum). His recent speaking engagements include Harvard, Stanford, Goldman Sachs, Forbes, and Davos.\n\nIn his personal time, Moritz is an avid Ironman and ultramarathon athlete, including the 257 km Marathon des Sables and the World Marathon Challenge (7 marathons on 7 continents in 7 consecutive days). With his races, he has raised over $250,000 for research to cure depression.\n\nModerated by John Nicoletti, VP of Google Customer Solutions",
        "published_date": "2025-05-29 16:01:23"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=MBdegZLhb6Q",
        "title": "Tom Pickett & Jenna Glover | Headspace & the ROI of Mindfulness | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/MBdegZLhb6Q?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Headspace CEO Tom Pickett and Chief Clinical Officer Dr. Jenna Glover discuss the tangible benefits of incorporating mindfulness practices into both personal and professional life.\n\nLearn practical mindfulness strategies from Headspace experts to improve focus, reduce stress, enhance well-being, and boost productivity, understanding its positive impact on both individuals and the business bottom line.\n\nLearn more: https://www.headspace.com/\n\nTom Pickett is the CEO of Headspace, leading the company on its mission to provide every person access to lifelong mental health support. Before joining Headspace, Tom served as the Chief Revenue Officer at DoorDash, where he oversaw the company’s merchant organization and led overall strategy with merchant partners. Prior to that, he was the CEO of Ellation (now Crunchyroll), a high-growth digital media company acquired by AT&amp;T in 2018. Under his leadership, Ellation’s subscriber base and revenue grew nearly 10x in just four years. Earlier in his career, Tom spent over a decade at Google, where he held multiple leadership roles, including Vice President of Content and Operations and a member of the YouTube executive leadership team. During his tenure, YouTube evolved from a 100-person startup to a global, multi-billion dollar enterprise. Before entering the corporate workforce, Tom graduated from TOPGUN and served for nearly a decade as an F/A-18 fighter pilot in the U.S. Navy.\n\nDr. Jenna Glover is Chief Clinical Officer at Headspace, where she oversees the company’s Care Services, including coaching, therapy, psychiatry, QA and training, and care enablement teams, to ensure members receive high-quality, culturally-responsive care. She previously served as an Associate Professor in the Department of Psychiatry at the University of Colorado School of Medicine, Director of Psychology Training at Children’s Hospital Colorado, and as the lead psychologist at Avalon Hills, a residential eating disorders program based in Logan, Utah. Jenna’s clinical work focuses on utilizing motivational interviewing and acceptance based therapies across a range of internalizing disorders. Her passion is working with others to develop skillful behaviors that help create a life worth living. Jenna also provides professional and community outreach, frequently delivering talks and lectures on promoting wellness and self-care. She has also given a TEDTalk on these topics. She has been honored with awards for teaching excellence, service to students, and wellness. Jenna is a licensed psychologist, and received her doctorate in Combined Clinical, Counseling, and School Psychology from Utah State University.\n\nModerated by Lauren Ford.",
        "published_date": "2025-05-25 16:00:29"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=lNYpj11oNsE",
        "title": "Dr. Judith Joseph | High Functioning: Overcome Your Hidden Depression... | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/lNYpj11oNsE?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Board-certified psychiatrist, researcher and award-winning content creator who specializes in mental health and trauma, Dr. Judith Joseph, discusses her book “High Functioning: Overcome Your Hidden Depression and Reclaim Your Joy,” the first book to unmask the hidden face of depression. \n\nDr. Judith draws on original research, client cases, and her own personal struggles with HFD to demystify this poorly understood condition. Her five simple tools—the Five V’s—will help you understand the science of your happiness and empower you to reclaim your life and joy.\n\nGet the book here: https://highfunctioningbook.com/  \nLearn more about Dr. Joseph: https://drjudithjoseph.com/\nDr. Judith Joseph's YouTube Channel: https://www.youtube.com/@drjudithjoseph\n\nDr. Judith Joseph MD MBA is chair of the women in medicine initiative at Columbia University Vagelos College of Physicians and Surgeons, clinical assistant professor in child and adolescent psychiatry at NYU Grossman School of Medicine and Principal Investigator at Manhattan Behavioral Medicine, New York City’s Premier Clinical Research Site. She was one of the experts featured in Oprah Daily’s 2023 The Menopause Special and “The Magic of Menopause” Masterclass alongside Halle Berry and other experts. She is a board member of the national non-profit Let’s Talk Menopause. \n\nDr. Judith was awarded by the US House of Representatives with a 2023 Congress Proclamation Award for her social media advocacy and mental health research. In 2024, she was named a top 6 NAACP Mental Health Champion and a VeryWell Mind top 25 Thought leader. That same year, she taught a Workplace Mental Health Course to The Executive Office Of The President of The United States of America. In addition to being a notable public speaker at prestigious institutions, such as Columbia University, Concordia and United Nations UNGA events, Dr. Judith is a sought-after on-air expert. Dr. Judith uses her platform of over 1 million followers to educate her community about mental health topics and she trains doctors at NYU about how to use various forms of media to educate the public about mental health issues.\n\nModerated by Lana Garrett.\n\nAdditional Resources:\nAnhedonia Quiz: https://drjudithjoseph.com/anhedoniaquiz/\nHigh Functioning Depression Study:\nhttps://www.cureus.com/articles/322152-understanding-high-functioning-depression-in-adults#!/",
        "published_date": "2025-05-15 16:01:12"
    },
    {
        "website": "YOUTUBE_GOOGLE_TALKS",
        "link": "https://www.youtube.com/watch?v=KJnpmXeHWnY",
        "title": "Noor Murad | Lugma: Abundant Dishes & Stories From My Middle East | Talks at Google",
        "thumbnail": "https://www.youtube.com/v/KJnpmXeHWnY?version=3",
        "author": "Talks at Google",
        "track": null,
        "description": "Chef and author Noor Murad discusses her book “Lugma: Abundant Dishes & Stories From My Middle East,” which offers over 100 recipes as an ode to the food she grew up eating—traditional flavors and modern dishes from Bahrain, the surrounding Middle East, and beyond.\n\nGet the book here: https://goo.gle/4iuhznM.  \n\nBahrain-born, London-based and New York trained, Noor Murad joined the Ottolenghi Test Kitchen in 2018, where she worked as a recipe developer for Falastin and Flavor as well as Ottolenghi's New York Times and Guardian columns. She became the head of the Ottolenghi Test Kitchen, and wrote the Ottolenghi Test Kitchen books: Shelf Love and Extra Good Things. Her own recipes have been featured in the New York Times and she has cooked on BBC's Saturday Kitchen. Her Middle Eastern roots have a strong influence on her cooking, with Arabic, Indian, and Persian flavors making a prominent appearance in her recipes.\n\nModerated by Lara Suleiman.",
        "published_date": "2025-05-12 17:00:26"
    }
]